{
  "title": "Video Overview: The Louisiana Purchase",
  "duration_estimate": "8-10 minutes",
  "sections": [
    {
      "section": "Introduction",
      "duration": "30 seconds",
      "narration": "Welcome to our lesson on The Louisiana Purchase. Doubling the Nation (1803). You'll experience this story through the eyes of Marie, age 14, daughter of a French trader in New Orleans, 1803.",
      "visuals": [
        "Title card: The Louisiana Purchase",
        "Historical map or period artwork",
        "Narrator character introduction"
      ]
    },
    {
      "section": "Chapter 1: A Territory Changes Hands",
      "duration": "1-2 minutes",
      "narration": "I'm Marie, fourteen, living in New Orleans. My city has been French, then Spanish, now French again, and today I learned we're about to become American! The news arrived: President Jefferson has purchased all of Louisiana from Napoleon for $15 million. The Louisiana Territory is enormous—over 800,000 square miles stretching from the Mississippi River to the Rocky Mountains.",
      "visuals": [
        "Chapter title: A Territory Changes Hands",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "I'm Marie, fourteen, living in New Orleans."
    },
    {
      "section": "Chapter 2: New Opportunities",
      "duration": "1-2 minutes",
      "narration": "The Purchase solves major problems for America. We needed access to New Orleans—the mouth of the Mississippi River where western farmers ship their goods. France controlling it was dangerous. Now America controls the entire Mississippi River system.",
      "visuals": [
        "Chapter title: New Opportunities",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "The Purchase solves major problems for America."
    },
    {
      "section": "Chapter 3: Jefferson's Dilemma",
      "duration": "1-2 minutes",
      "narration": "My father explains President Jefferson's predicament. Jefferson has always preached strict construction—the federal government should only exercise powers explicitly granted in the Constitution. He's criticized Hamilton and the Federalists for loose interpretation, claiming they stretch the Constitution to justify whatever they want. But the Constitution says nothing about purchasing foreign territory.",
      "visuals": [
        "Chapter title: Jefferson's Dilemma",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "My father explains President Jefferson's predicament."
    },
    {
      "section": "Chapter 4: Life in New Orleans",
      "duration": "1-2 minutes",
      "narration": "My city, New Orleans, is unlike anywhere else in America. We're French and Spanish, Catholic and Creole. We speak French more than English. We have free people of color who own businesses and property—something unheard of in most of America.",
      "visuals": [
        "Chapter title: Life in New Orleans",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "My city, New Orleans, is unlike anywhere else in America."
    },
    {
      "section": "Chapter 5: The Price of Expansion",
      "duration": "1-2 minutes",
      "narration": "While Americans celebrate acquiring vast new territory, few ask about the people already living there. Tens of thousands of Native peoples call Louisiana home: Osage, Caddo, Choctaw, Chickasaw, and dozens of other nations. France just sold their land without their consent. America just bought it without acknowledging Native ownership.",
      "visuals": [
        "Chapter title: The Price of Expansion",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "While Americans celebrate acquiring vast new territory, few ask about the people already living there."
    },
    {
      "section": "Conclusion",
      "duration": "30 seconds",
      "narration": "In this lesson, we explored The Louisiana Purchase through 5 chapters. Key concepts included: Louisiana Purchase, Napoleon Bonaparte, New Orleans, Mississippi River.",
      "visuals": [
        "Summary graphic with key points",
        "Timeline showing events covered",
        "Call to action for quiz/flashcards"
      ]
    }
  ]
}