{
  "title": "The Rough Rider President",
  "subtitle": "Theodore Roosevelt and the Progressive Era (1901-1909)",
  "time_period": "1901-1909",
  "narrator": "Theodore Roosevelt, 26th President of the United States, 1901",
  "sections": [
    {
      "number": 1,
      "title": "From Sickly Boy to Rough Rider",
      "summary": "My name is Theodore Roosevelt, and I was not supposed to survive childhood. Born in 1858 to a wealthy New York family, I suffered from terrible asthma that left me gasping for breath, weak and confined indoors while other boys played. The doctors said I had a weak constitution and would never be str..."
    },
    {
      "number": 2,
      "title": "An Accidental President",
      "summary": "On September 14, 1901, I became President of the United States at age 42—the youngest president in American history. But I did not want it to happen this way. President McKinley had been shot by an assassin eight days earlier at the Pan-American Exposition in Buffalo."
    },
    {
      "number": 3,
      "title": "Trust-Busting and the Square Deal",
      "summary": "America in 1901 was dominated by massive corporations—trusts—that controlled entire industries. J.P. Morgan's banking empire, John D."
    },
    {
      "number": 4,
      "title": "Conservation: Preserving America's Natural Heritage",
      "summary": "Of all my achievements, I am most proud of my conservation work. I was America's first conservation president, and I used every power at my disposal to protect our natural heritage. Growing up, I loved nature—studying birds, collecting specimens, exploring forests."
    },
    {
      "number": 5,
      "title": "Speaking Softly and Carrying a Big Stick",
      "summary": "\"Speak softly and carry a big stick; you will go far.\" This West African proverb became my motto for foreign policy. I believed America should be strong, confident, and willing to use power—but preferably to avoid war rather than wage it. When I became president, America was emerging as a world powe..."
    },
    {
      "number": 6,
      "title": "The Bully Pulpit and Progressive Legacy",
      "summary": "I loved being President. The presidency gave me what I called a \"bully pulpit\"—a platform to speak directly to the American people and advocate for the causes I believed in. And I used it constantly."
    }
  ],
  "key_facts": [
    "My name is Theodore Roosevelt, and I was not supposed to survive childhood.",
    "On September 14, 1901, I became President of the United States at age 42—the youngest president in American history.",
    "America in 1901 was dominated by massive corporations—trusts—that controlled entire industries.",
    "Of all my achievements, I am most proud of my conservation work.",
    "\"Speak softly and carry a big stick; you will go far.\" This West African proverb became my motto for foreign policy.",
    "The presidency gave me what I called a \"bully pulpit\"—a platform to speak directly to the American people and advocate for the causes I believed in."
  ],
  "timeline_events": [],
  "vocabulary": [
    {
      "term": "Theodore Roosevelt",
      "definition": "26th President of the United States (1901-1909), youngest president at age 42, known for progressive reforms, conservation, and 'Big Stick' foreign po..."
    },
    {
      "term": "Rough Riders",
      "definition": "Volunteer cavalry regiment led by Theodore Roosevelt during the Spanish-American War in 1898. Famous for charging up San Juan Hill in Cuba, making Roo..."
    },
    {
      "term": "Trust-Busting",
      "definition": "Roosevelt's policy of using federal power to break up large monopolies (trusts) that dominated industries and stifled competition. He brought 44 antit..."
    },
    {
      "term": "Square Deal",
      "definition": "Roosevelt's domestic program promising fairness for all Americans. The government would act as honest broker between labor and capital, ensuring no gr..."
    },
    {
      "term": "Northern Securities Company",
      "definition": "Railroad trust created by J.P. Morgan that Roosevelt successfully broke up in 1904, establishing that even the most powerful corporations must obey an..."
    },
    {
      "term": "Conservation",
      "definition": "Roosevelt's policy of protecting and wisely using natural resources for future generations. He established 5 National Parks, 18 National Monuments, an..."
    }
  ]
}