{
  "title": "The Mayflower Compact",
  "subtitle": "Plymouth Colony and the Pilgrims (1620-1630)",
  "time_period": "1620-1630",
  "narrator": "Elizabeth, age 12, a Pilgrim aboard the Mayflower, 1620",
  "sections": [
    {
      "number": 1,
      "title": "Separating from the Church",
      "summary": "My name is Elizabeth, and I am twelve years old. My family are Separatists—we broke away from the Church of England because we believe it is corrupt. In England, this belief made us criminals."
    },
    {
      "number": 2,
      "title": "The Mayflower Compact",
      "summary": "When we finally sighted land, we faced an immediate problem: we were far north of Virginia, outside the Virginia Company's territory. This meant we had no legal government. Some of the Strangers said they would do as they pleased since no laws bound them here."
    },
    {
      "number": 3,
      "title": "The First Winter",
      "summary": "We arrived in November, far too late to plant crops. We had to build shelter before winter's full fury struck. The men worked desperately to construct a common house and a few small homes, but progress was slow in the cold."
    },
    {
      "number": 4,
      "title": "Help from Squanto",
      "summary": "In March, an amazing thing happened. A Native American man walked into our settlement and greeted us in English! His name was Samoset, and he brought us to meet Massasoit, the leader of the Wampanoag people."
    },
    {
      "number": 5,
      "title": "A New Beginning",
      "summary": "I am eighteen now, and Plymouth is a real town. We have sturdy houses, productive fields, and enough food stored for winter. More ships bring new settlers each year."
    }
  ],
  "key_facts": [
    "My family are Separatists—we broke away from the Church of England because we believe it is corrupt.",
    "When we finally sighted land, we faced an immediate problem: we were far north of Virginia, outside the Virginia Company's territory.",
    "We arrived in November, far too late to plant crops.",
    "A Native American man walked into our settlement and greeted us in English!",
    "We have sturdy houses, productive fields, and enough food stored for winter."
  ],
  "timeline_events": [],
  "vocabulary": [
    {
      "term": "Pilgrims",
      "definition": "English Separatists who left England for religious freedom, first to Holland and then to America aboard the Mayflower in 1620."
    },
    {
      "term": "Separatists",
      "definition": "Christians who wanted to separate completely from the Church of England, believing it was too similar to the Catholic Church."
    },
    {
      "term": "Mayflower",
      "definition": "The ship that carried 102 Pilgrims across the Atlantic Ocean to America in 1620, a journey that took 66 days."
    },
    {
      "term": "Mayflower Compact",
      "definition": "An agreement signed in 1620 by 41 male Pilgrims to create a government and obey its laws, an important step toward self-government."
    },
    {
      "term": "Plymouth Colony",
      "definition": "The second permanent English colony in America, established by the Pilgrims in present-day Massachusetts in 1620."
    },
    {
      "term": "William Bradford",
      "definition": "The governor of Plymouth Colony who led the Pilgrims through difficult times and wrote a history of the colony."
    }
  ]
}