{
  "title": "Reconstruction Begins",
  "subtitle": "Rebuilding the South (1865-1867)",
  "time_period": "1865-1867",
  "narrator": "Marcus, age 15, freed slave in Georgia, 1865",
  "sections": [
    {
      "number": 1,
      "title": "The Day of Jubilee",
      "summary": "I'm Marcus, fifteen years old, and I was born enslaved on a cotton plantation in Georgia. I've worked in the fields since I was seven—planting, weeding, picking cotton from dawn to dusk. I've been whipped for working too slowly."
    },
    {
      "number": 2,
      "title": "The Freedmen's Bureau",
      "summary": "Days after emancipation, most formerly enslaved people are still on the plantations. Some leave immediately, seeking family members sold away or just wanting to experience freedom by traveling. But most stay, not because we want to but because we have nowhere else to go."
    },
    {
      "number": 3,
      "title": "The Promise of Land",
      "summary": "Summer 1865. There are rumors spreading through freed communities: \"Forty acres and a mule.\" The government will give freed people land confiscated from Confederate plantations. The rumor comes from General Sherman's Special Field Order No."
    },
    {
      "number": 4,
      "title": "The Black Codes",
      "summary": "Fall 1865. Southern states begin passing \"Black Codes\"—laws specifically targeting freed people and restricting our freedom. Georgia's Black Code requires freed people to have written proof of employment."
    },
    {
      "number": 5,
      "title": "Presidential Reconstruction Fails",
      "summary": "By late 1865, it's clear that President Andrew Johnson's Reconstruction policy has failed. Johnson pardoned most former Confederates, allowed them to vote and hold office, and did nothing to stop the Black Codes. He opposes federal intervention to protect freed people's rights."
    }
  ],
  "key_facts": [
    "I'm Marcus, fifteen years old, and I was born enslaved on a cotton plantation in Georgia.",
    "Days after emancipation, most formerly enslaved people are still on the plantations.",
    "There are rumors spreading through freed communities: \"Forty acres and a mule.\" The government will give freed people land confiscated from Confederate plantations.",
    "Southern states begin passing \"Black Codes\"—laws specifically targeting freed people and restricting our freedom.",
    "By late 1865, it's clear that President Andrew Johnson's Reconstruction policy has failed."
  ],
  "timeline_events": [],
  "vocabulary": [
    {
      "term": "Reconstruction",
      "definition": "Period (1865-1877) of rebuilding South and integrating freed slaves into society."
    },
    {
      "term": "Thirteenth Amendment",
      "definition": "1865 amendment abolishing slavery throughout the United States."
    },
    {
      "term": "Freedmen's Bureau",
      "definition": "Federal agency helping freed slaves with food, education, and labor contracts."
    },
    {
      "term": "Black Codes",
      "definition": "Southern laws restricting freed slaves' rights and movement."
    },
    {
      "term": "Sharecropping",
      "definition": "System where freed slaves worked land for share of crop, often resulting in debt."
    },
    {
      "term": "Andrew Johnson",
      "definition": "President whose lenient Reconstruction policies angered Republicans."
    }
  ]
}