{
  "title": "Video Overview: Reconstruction Begins",
  "duration_estimate": "8-10 minutes",
  "sections": [
    {
      "section": "Introduction",
      "duration": "30 seconds",
      "narration": "Welcome to our lesson on Reconstruction Begins. Rebuilding the South (1865-1867). You'll experience this story through the eyes of Marcus, age 15, freed slave in Georgia, 1865.",
      "visuals": [
        "Title card: Reconstruction Begins",
        "Historical map or period artwork",
        "Narrator character introduction"
      ]
    },
    {
      "section": "Chapter 1: The Day of Jubilee",
      "duration": "1-2 minutes",
      "narration": "I'm Marcus, fifteen years old, and I was born enslaved on a cotton plantation in Georgia. I've worked in the fields since I was seven—planting, weeding, picking cotton from dawn to dusk. I've been whipped for working too slowly. I've watched my older sister sold away when I was ten.",
      "visuals": [
        "Chapter title: The Day of Jubilee",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "I'm Marcus, fifteen years old, and I was born enslaved on a cotton plantation in Georgia."
    },
    {
      "section": "Chapter 2: The Freedmen's Bureau",
      "duration": "1-2 minutes",
      "narration": "Days after emancipation, most formerly enslaved people are still on the plantations. Some leave immediately, seeking family members sold away or just wanting to experience freedom by traveling. But most stay, not because we want to but because we have nowhere else to go. The Union army establishes the Freedmen's Bureau—an agency to help formerly enslaved people transition to freedom.",
      "visuals": [
        "Chapter title: The Freedmen's Bureau",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "Days after emancipation, most formerly enslaved people are still on the plantations."
    },
    {
      "section": "Chapter 3: The Promise of Land",
      "duration": "1-2 minutes",
      "narration": "Summer 1865. There are rumors spreading through freed communities: \"Forty acres and a mule.\" The government will give freed people land confiscated from Confederate plantations. The rumor comes from General Sherman's Special Field Order No. 15, issued in January 1865.",
      "visuals": [
        "Chapter title: The Promise of Land",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "Summer 1865."
    },
    {
      "section": "Chapter 4: The Black Codes",
      "duration": "1-2 minutes",
      "narration": "Fall 1865. Southern states begin passing \"Black Codes\"—laws specifically targeting freed people and restricting our freedom. Georgia's Black Code requires freed people to have written proof of employment. If you don't have a contract with a landowner, you can be arrested for vagrancy and forced to work for whoever pays your fine.",
      "visuals": [
        "Chapter title: The Black Codes",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "Fall 1865."
    },
    {
      "section": "Chapter 5: Presidential Reconstruction Fails",
      "duration": "1-2 minutes",
      "narration": "By late 1865, it's clear that President Andrew Johnson's Reconstruction policy has failed. Johnson pardoned most former Confederates, allowed them to vote and hold office, and did nothing to stop the Black Codes. He opposes federal intervention to protect freed people's rights. Johnson believes Reconstruction should be lenient and quick.",
      "visuals": [
        "Chapter title: Presidential Reconstruction Fails",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "By late 1865, it's clear that President Andrew Johnson's Reconstruction policy has failed."
    },
    {
      "section": "Conclusion",
      "duration": "30 seconds",
      "narration": "In this lesson, we explored Reconstruction Begins through 5 chapters. Key concepts included: Reconstruction, Thirteenth Amendment, Freedmen's Bureau, Black Codes.",
      "visuals": [
        "Summary graphic with key points",
        "Timeline showing events covered",
        "Call to action for quiz/flashcards"
      ]
    }
  ]
}