{
  "title": "The Great Awakening",
  "subtitle": "Religious Revival in the Colonies (1730-1750)",
  "time_period": "1730-1750",
  "narrator": "Sarah, age 14, daughter of a Connecticut farmer, 1741",
  "sections": [
    {
      "number": 1,
      "title": "The Traveling Preacher",
      "summary": "My name is Sarah, and I am fourteen years old. Today, something extraordinary happened in our small Connecticut town. A traveling preacher named George Whitefield came to speak, and everything changed."
    },
    {
      "number": 2,
      "title": "Old Lights vs. New Lights",
      "summary": "Whitefield's visit divided our community. Some people, now called \"New Lights,\" embraced this emotional, personal religion. They attended revival meetings, shared testimonies of their conversion experiences, and questioned whether ministers who hadn't been \"born again\" should even preach."
    },
    {
      "number": 3,
      "title": "A Democratization of Religion",
      "summary": "The Great Awakening changed how people thought about authority—both religious and political. If ordinary people could have direct access to God without needing educated ministers to interpret for them, what other authority could be questioned? New congregations formed when people left churches whose..."
    },
    {
      "number": 4,
      "title": "Long-Term Changes",
      "summary": "The Great Awakening created lasting changes in colonial society. New denominations formed—Baptists and Methodists grew rapidly. New colleges would be founded to train revival-minded ministers—Princeton was established just a few years later in 1746, and others would follow in coming decades."
    },
    {
      "number": 5,
      "title": "Finding My Own Voice",
      "summary": "Three years have passed since Whitefield's visit, and I'm seventeen now. The Great Awakening changed me in ways I'm still discovering. I joined a New Light congregation that meets in a barn because we left the established church."
    }
  ],
  "key_facts": [
    "Today, something extraordinary happened in our small Connecticut town.",
    "Some people, now called \"New Lights,\" embraced this emotional, personal religion.",
    "The Great Awakening changed how people thought about authority—both religious and political.",
    "The Great Awakening created lasting changes in colonial society.",
    "Three years have passed since Whitefield's visit, and I'm seventeen now."
  ],
  "timeline_events": [],
  "vocabulary": [
    {
      "term": "Great Awakening",
      "definition": "A religious revival movement in the 1730s-1740s emphasizing personal faith, emotional preaching, and individual conversion experiences."
    },
    {
      "term": "George Whitefield",
      "definition": "A powerful revivalist preacher who traveled throughout the colonies, drawing huge crowds with his emotional sermons."
    },
    {
      "term": "Jonathan Edwards",
      "definition": "New England minister famous for his sermon 'Sinners in the Hands of an Angry God,' which vividly described hell and divine judgment."
    },
    {
      "term": "New Lights",
      "definition": "Supporters of the Great Awakening who favored emotional, personal religion and revivalist preaching."
    },
    {
      "term": "Old Lights",
      "definition": "Opponents of the Great Awakening who preferred traditional, rational, orderly religious practices."
    },
    {
      "term": "Born Again",
      "definition": "The revivalist concept of experiencing a dramatic personal conversion and receiving God's saving grace."
    }
  ]
}