{
  "title": "Video Overview: The Great Awakening",
  "duration_estimate": "8-10 minutes",
  "sections": [
    {
      "section": "Introduction",
      "duration": "30 seconds",
      "narration": "Welcome to our lesson on The Great Awakening. Religious Revival in the Colonies (1730-1750). You'll experience this story through the eyes of Sarah, age 14, daughter of a Connecticut farmer, 1741.",
      "visuals": [
        "Title card: The Great Awakening",
        "Historical map or period artwork",
        "Narrator character introduction"
      ]
    },
    {
      "section": "Chapter 1: The Traveling Preacher",
      "duration": "1-2 minutes",
      "narration": "My name is Sarah, and I am fourteen years old. Today, something extraordinary happened in our small Connecticut town. A traveling preacher named George Whitefield came to speak, and everything changed. We gathered in a field because no church could hold the crowd.",
      "visuals": [
        "Chapter title: The Traveling Preacher",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "My name is Sarah, and I am fourteen years old."
    },
    {
      "section": "Chapter 2: Old Lights vs. New Lights",
      "duration": "1-2 minutes",
      "narration": "Whitefield's visit divided our community. Some people, now called \"New Lights,\" embraced this emotional, personal religion. They attended revival meetings, shared testimonies of their conversion experiences, and questioned whether ministers who hadn't been \"born again\" should even preach. A famous minister from Northampton, Massachusetts—Reverend Jonathan Edwards—came to preach at our meetinghouse.",
      "visuals": [
        "Chapter title: Old Lights vs. New Lights",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "Whitefield's visit divided our community."
    },
    {
      "section": "Chapter 3: A Democratization of Religion",
      "duration": "1-2 minutes",
      "narration": "The Great Awakening changed how people thought about authority—both religious and political. If ordinary people could have direct access to God without needing educated ministers to interpret for them, what other authority could be questioned? New congregations formed when people left churches whose ministers they felt were unconverted. Previously, you belonged to the church in your town.",
      "visuals": [
        "Chapter title: A Democratization of Religion",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "The Great Awakening changed how people thought about authority—both religious and political."
    },
    {
      "section": "Chapter 4: Long-Term Changes",
      "duration": "1-2 minutes",
      "narration": "The Great Awakening created lasting changes in colonial society. New denominations formed—Baptists and Methodists grew rapidly. New colleges would be founded to train revival-minded ministers—Princeton was established just a few years later in 1746, and others would follow in coming decades. The emphasis on personal choice and individual conscience planted seeds of independent thinking.",
      "visuals": [
        "Chapter title: Long-Term Changes",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "The Great Awakening created lasting changes in colonial society."
    },
    {
      "section": "Chapter 5: Finding My Own Voice",
      "duration": "1-2 minutes",
      "narration": "Three years have passed since Whitefield's visit, and I'm seventeen now. The Great Awakening changed me in ways I'm still discovering. I joined a New Light congregation that meets in a barn because we left the established church. Here, I've found something remarkable: my voice matters.",
      "visuals": [
        "Chapter title: Finding My Own Voice",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "Three years have passed since Whitefield's visit, and I'm seventeen now."
    },
    {
      "section": "Conclusion",
      "duration": "30 seconds",
      "narration": "In this lesson, we explored The Great Awakening through 5 chapters. Key concepts included: Great Awakening, George Whitefield, Jonathan Edwards, New Lights.",
      "visuals": [
        "Summary graphic with key points",
        "Timeline showing events covered",
        "Call to action for quiz/flashcards"
      ]
    }
  ]
}