{
  "title": "The Mexican-American War",
  "subtitle": "War and Territorial Gains (1846-1848)",
  "time_period": "1846-1848",
  "narrator": "Miguel, age 16, American soldier, 1847",
  "sections": [
    {
      "number": 1,
      "title": "War with Mexico",
      "summary": "I'm Miguel, sixteen, a private in the U.S. Army fighting in Mexico. My family is from New Mexico, Spanish-speaking Catholics who've lived here for generations."
    },
    {
      "number": 2,
      "title": "The Campaigns",
      "summary": "The war has gone badly for Mexico from the start. General Zachary Taylor captured Monterrey and defeated a larger Mexican force at Buena Vista. General Winfield Scott landed at Veracruz and marched inland toward Mexico City, following the route Cortés took three centuries earlier."
    },
    {
      "number": 3,
      "title": "The Price of Victory",
      "summary": "The war cost about 13,000 American lives—though most died of disease, not battle. Mexican casualties were far higher, including thousands of civilians. We've devastated their country, killed their young men, occupied their capital."
    },
    {
      "number": 4,
      "title": "The Slavery Question Returns",
      "summary": "The war's most dangerous consequence isn't in Mexico—it's in America. We've gained over 500,000 square miles of new territory, and every inch reopens the question: will it be slave or free? Even before the war ended, Congressman David Wilmot proposed the Wilmot Proviso—banning slavery in any territo..."
    },
    {
      "number": 5,
      "title": "An Unjust War",
      "summary": "Looking back, I see the Mexican-American War as a dark chapter in American history. We provoked a weaker neighbor into war, conquered half their country, and took their land. We claimed Manifest Destiny and moral superiority while acting like any other conquering empire."
    }
  ],
  "key_facts": [
    "My family is from New Mexico, Spanish-speaking Catholics who've lived here for generations.",
    "General Zachary Taylor captured Monterrey and defeated a larger Mexican force at Buena Vista.",
    "The war cost about 13,000 American lives—though most died of disease, not battle.",
    "The war's most dangerous consequence isn't in Mexico—it's in America.",
    "Looking back, I see the Mexican-American War as a dark chapter in American history."
  ],
  "timeline_events": [],
  "vocabulary": [
    {
      "term": "Mexican-American War",
      "definition": "1846-1848 war resulting in U.S. acquiring vast Mexican territory."
    },
    {
      "term": "Treaty of Guadalupe Hidalgo",
      "definition": "1848 treaty ending war, Mexico ceding half its territory to U.S."
    },
    {
      "term": "Mexican Cession",
      "definition": "Land Mexico gave up: California, Nevada, Utah, Arizona, New Mexico, parts of Colorado/Wyoming."
    },
    {
      "term": "Zachary Taylor",
      "definition": "General who won key battles in Mexican War, later became President."
    },
    {
      "term": "Winfield Scott",
      "definition": "General who captured Mexico City, ending the war."
    },
    {
      "term": "Bear Flag Revolt",
      "definition": "American settlers' rebellion in California during Mexican War."
    }
  ]
}