{
  "title": "Video Overview: The Mexican-American War",
  "duration_estimate": "8-10 minutes",
  "sections": [
    {
      "section": "Introduction",
      "duration": "30 seconds",
      "narration": "Welcome to our lesson on The Mexican-American War. War and Territorial Gains (1846-1848). You'll experience this story through the eyes of Miguel, age 16, American soldier, 1847.",
      "visuals": [
        "Title card: The Mexican-American War",
        "Historical map or period artwork",
        "Narrator character introduction"
      ]
    },
    {
      "section": "Chapter 1: War with Mexico",
      "duration": "1-2 minutes",
      "narration": "I'm Miguel, sixteen, a private in the U.S. Army fighting in Mexico. My family is from New Mexico, Spanish-speaking Catholics who've lived here for generations. When Texas joined the Union last year and President Polk sent troops to the disputed border, war became inevitable.",
      "visuals": [
        "Chapter title: War with Mexico",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "I'm Miguel, sixteen, a private in the U.S."
    },
    {
      "section": "Chapter 2: The Campaigns",
      "duration": "1-2 minutes",
      "narration": "The war has gone badly for Mexico from the start. General Zachary Taylor captured Monterrey and defeated a larger Mexican force at Buena Vista. General Winfield Scott landed at Veracruz and marched inland toward Mexico City, following the route Cortés took three centuries earlier. Scott is brilliant—he's taken fortress after fortress with minimal American casualties.",
      "visuals": [
        "Chapter title: The Campaigns",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "The war has gone badly for Mexico from the start."
    },
    {
      "section": "Chapter 3: The Price of Victory",
      "duration": "1-2 minutes",
      "narration": "The war cost about 13,000 American lives—though most died of disease, not battle. Mexican casualties were far higher, including thousands of civilians. We've devastated their country, killed their young men, occupied their capital. And for what?",
      "visuals": [
        "Chapter title: The Price of Victory",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "The war cost about 13,000 American lives—though most died of disease, not battle."
    },
    {
      "section": "Chapter 4: The Slavery Question Returns",
      "duration": "1-2 minutes",
      "narration": "The war's most dangerous consequence isn't in Mexico—it's in America. We've gained over 500,000 square miles of new territory, and every inch reopens the question: will it be slave or free? Even before the war ended, Congressman David Wilmot proposed the Wilmot Proviso—banning slavery in any territory acquired from Mexico. The idea inflamed the South.",
      "visuals": [
        "Chapter title: The Slavery Question Returns",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "The war's most dangerous consequence isn't in Mexico—it's in America."
    },
    {
      "section": "Chapter 5: An Unjust War",
      "duration": "1-2 minutes",
      "narration": "Looking back, I see the Mexican-American War as a dark chapter in American history. We provoked a weaker neighbor into war, conquered half their country, and took their land. We claimed Manifest Destiny and moral superiority while acting like any other conquering empire. President Polk got everything he wanted—California, New Mexico, settlement of the Texas border.",
      "visuals": [
        "Chapter title: An Unjust War",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "Looking back, I see the Mexican-American War as a dark chapter in American history."
    },
    {
      "section": "Conclusion",
      "duration": "30 seconds",
      "narration": "In this lesson, we explored The Mexican-American War through 5 chapters. Key concepts included: Mexican-American War, Treaty of Guadalupe Hidalgo, Mexican Cession, Zachary Taylor.",
      "visuals": [
        "Summary graphic with key points",
        "Timeline showing events covered",
        "Call to action for quiz/flashcards"
      ]
    }
  ]
}