{
  "title": "The Monroe Doctrine",
  "subtitle": "American Foreign Policy (1823)",
  "time_period": "1823",
  "narrator": "Clara, age 15, daughter of a State Department clerk, 1823",
  "sections": [
    {
      "number": 1,
      "title": "Europe and the Americas",
      "summary": "I'm Clara, fifteen, and my father works at the State Department in Washington. Today President Monroe announced a new foreign policy that will shape America's future: the Monroe Doctrine. The situation is this: Spain's colonies in Latin America have been fighting for independence, inspired by our re..."
    },
    {
      "number": 2,
      "title": "American Confidence",
      "summary": "The Monroe Doctrine shows how much America has changed since 1776. We've survived two wars with Britain. We've doubled our size."
    },
    {
      "number": 3,
      "title": "The Holy Alliance Threat",
      "summary": "Father explains why the doctrine was necessary. After Napoleon's defeat, European monarchies formed the Holy Alliance—Russia, Prussia, Austria, and later France. They were committed to crushing republican and democratic movements, restoring monarchy and \"legitimate\" rule wherever revolutions occurre..."
    },
    {
      "number": 4,
      "title": "Latin American Independence",
      "summary": "I've learned about the revolutions sweeping Latin America. Leaders like Simón Bolívar in South America and Miguel Hidalgo in Mexico led wars for independence, inspired by America's example. They wrote constitutions modeled on ours, established republics, abolished many (though not all) aspects of co..."
    },
    {
      "number": 5,
      "title": "Claiming the Hemisphere",
      "summary": "The Monroe Doctrine reveals American ambitions. We're not just protecting other nations' independence—we're claiming the Western Hemisphere as our sphere of influence. We're warning Europe that we'll be the dominant power here, that our interests matter most in the Americas."
    },
    {
      "number": 6,
      "title": "A New American Role",
      "summary": "The Monroe Doctrine marks America's transition from struggling republic to confident power. Just forty years after our founding, we're declaring ourselves protector of an entire hemisphere. We're telling European empires—Britain, France, Spain, Russia—to stay out of Western Hemisphere affairs."
    }
  ],
  "key_facts": [
    "I'm Clara, fifteen, and my father works at the State Department in Washington.",
    "The Monroe Doctrine shows how much America has changed since 1776.",
    "After Napoleon's defeat, European monarchies formed the Holy Alliance—Russia, Prussia, Austria, and later France.",
    "I've learned about the revolutions sweeping Latin America.",
    "We're not just protecting other nations' independence—we're claiming the Western Hemisphere as our sphere of influence.",
    "The Monroe Doctrine marks America's transition from struggling republic to confident power."
  ],
  "timeline_events": [],
  "vocabulary": [
    {
      "term": "Monroe Doctrine",
      "definition": "1823 policy declaring the Western Hemisphere closed to European colonization and interference."
    },
    {
      "term": "James Monroe",
      "definition": "Fifth President who issued the Monroe Doctrine establishing America's sphere of influence."
    },
    {
      "term": "John Quincy Adams",
      "definition": "Secretary of State who helped craft the Monroe Doctrine."
    },
    {
      "term": "Sphere of Influence",
      "definition": "A region where a nation has dominant power and influence."
    },
    {
      "term": "Latin American Independence",
      "definition": "The movement of Spanish colonies to gain independence, which the Monroe Doctrine aimed to protect."
    },
    {
      "term": "Non-Colonization",
      "definition": "The Monroe Doctrine principle that the Americas were closed to new European colonies."
    }
  ]
}