{
  "title": "The Compromise of 1850",
  "subtitle": "Delaying the Inevitable (1850)",
  "time_period": "1850",
  "narrator": "Anna, age 15, from California, 1850",
  "sections": [
    {
      "number": 1,
      "title": "Crisis Over Slavery",
      "summary": "I'm Anna, fifteen, living in San Francisco. The California Gold Rush has transformed our territory overnight. In 1848, when gold was discovered at Sutter's Mill, California had maybe 14,000 non-Native residents."
    },
    {
      "number": 2,
      "title": "Clay's Compromise",
      "summary": "Henry Clay, now 73 and in failing health, proposes one last compromise to save the Union. He's brokered compromises before—the Missouri Compromise in 1820, the Tariff Compromise in 1833. He's called the \"Great Compromiser,\" though critics say he just postpones inevitable conflicts."
    },
    {
      "number": 3,
      "title": "The Fugitive Slave Act",
      "summary": "After months of debate, the Compromise passes in September 1850. California is admitted as the thirty-first state, a free state! We celebrate in San Francisco with parades, speeches, and fireworks."
    },
    {
      "number": 4,
      "title": "Popular Sovereignty's Flaw",
      "summary": "The compromise's popular sovereignty provision sounds democratic—let settlers decide slavery for themselves. But it's morally bankrupt. Whether human beings can be enslaved shouldn't be decided by majority vote."
    },
    {
      "number": 5,
      "title": "Temporary Peace",
      "summary": "The Compromise of 1850 brings temporary calm. Tensions ease. Talk of secession fades."
    }
  ],
  "key_facts": [
    "The California Gold Rush has transformed our territory overnight.",
    "Henry Clay, now 73 and in failing health, proposes one last compromise to save the Union.",
    "After months of debate, the Compromise passes in September 1850.",
    "The compromise's popular sovereignty provision sounds democratic—let settlers decide slavery for themselves.",
    "Many Americans are relieved that catastrophe was averted."
  ],
  "timeline_events": [],
  "vocabulary": [
    {
      "term": "Compromise of 1850",
      "definition": "Agreement admitting California free while strengthening fugitive slave laws."
    },
    {
      "term": "Fugitive Slave Act",
      "definition": "1850 law requiring Northerners to help capture escaped slaves."
    },
    {
      "term": "Popular Sovereignty",
      "definition": "Letting territorial settlers vote whether to allow slavery."
    },
    {
      "term": "Henry Clay",
      "definition": "The 'Great Compromiser' who brokered 1850 agreement."
    },
    {
      "term": "California Gold Rush",
      "definition": "1849 migration to California after gold discovery."
    },
    {
      "term": "Sectional Balance",
      "definition": "Equal number of free and slave states in Senate."
    }
  ]
}