{
  "title": "The Populist Movement",
  "subtitle": "Farmers Organize (1890s)",
  "time_period": "1890s",
  "narrator": "Emma, age 16, Kansas farm daughter, 1896",
  "sections": [
    {
      "number": 1,
      "title": "Drowning in Debt",
      "summary": "I'm Emma, sixteen years old, and I live on a wheat farm in Kansas. My family works from sunrise to sunset planting, tending, and harvesting wheat. We work harder every year."
    },
    {
      "number": 2,
      "title": "The Farmers' Alliance",
      "summary": "Farmers across the country are organizing. The Farmers' Alliance starts in Texas and spreads across the South and West. By 1890, it has over a million members."
    },
    {
      "number": 3,
      "title": "The People's Party",
      "summary": "In 1892, the Farmers' Alliance forms a political party: the People's Party, also called the Populist Party. At the founding convention in Omaha, Nebraska, we adopt a platform demanding sweeping reforms. The preamble is radical: \"We meet in the midst of a nation brought to the verge of moral, politic..."
    },
    {
      "number": 4,
      "title": "The Cross of Gold",
      "summary": "1896. The presidential election focuses on the money question: gold standard or free silver? Republicans nominate William McKinley, who supports the gold standard."
    },
    {
      "number": 5,
      "title": "Defeat and Legacy",
      "summary": "November 1896. McKinley wins. He carries the Northeast, Midwest, and urban areas."
    }
  ],
  "key_facts": [
    "I'm Emma, sixteen years old, and I live on a wheat farm in Kansas.",
    "The Farmers' Alliance starts in Texas and spreads across the South and West.",
    "In 1892, the Farmers' Alliance forms a political party: the People's Party, also called the Populist Party.",
    "The presidential election focuses on the money question: gold standard or free silver?",
    "He carries the Northeast, Midwest, and urban areas."
  ],
  "timeline_events": [],
  "vocabulary": [
    {
      "term": "Populist Party",
      "definition": "People's Party formed by farmers demanding economic reforms."
    },
    {
      "term": "William Jennings Bryan",
      "definition": "Populist Democrat famous for 'Cross of Gold' speech."
    },
    {
      "term": "Cross of Gold Speech",
      "definition": "Bryan's 1896 speech supporting free silver coinage."
    },
    {
      "term": "Free Silver",
      "definition": "Populist demand to coin unlimited silver, increasing money supply."
    },
    {
      "term": "Farmers' Alliance",
      "definition": "Organization of farmers fighting railroad and bank monopolies."
    },
    {
      "term": "Graduated Income Tax",
      "definition": "Tax system where wealthy pay higher percentage—Populist demand."
    }
  ]
}