{
  "title": "Video Overview: Lewis and Clark",
  "duration_estimate": "9-12 minutes",
  "sections": [
    {
      "section": "Introduction",
      "duration": "30 seconds",
      "narration": "Welcome to our lesson on Lewis and Clark. Exploring the West (1804-1806). You'll experience this story through the eyes of William, age 17, member of the Corps of Discovery, 1805.",
      "visuals": [
        "Title card: Lewis and Clark",
        "Historical map or period artwork",
        "Narrator character introduction"
      ]
    },
    {
      "section": "Chapter 1: Into the Unknown",
      "duration": "1-2 minutes",
      "narration": "I'm William, seventeen, and I'm part of the greatest adventure in American history. Meriwether Lewis and William Clark are leading the Corps of Discovery—about 40 men—to explore the Louisiana Purchase and beyond, all the way to the Pacific Ocean. President Jefferson gave Lewis specific orders: map the territory, find a water route to the Pacific, study plants and animals, establish relations with Native tribes. We left St.",
      "visuals": [
        "Chapter title: Into the Unknown",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "I'm William, seventeen, and I'm part of the greatest adventure in American history."
    },
    {
      "section": "Chapter 2: Sacagawea's Help",
      "duration": "1-2 minutes",
      "narration": "In North Dakota, we met Sacagawea, a Shoshone woman who joined us as interpreter and guide. She's about sixteen and carries her baby son on her back. Her presence signals peaceful intentions to tribes we meet—no war party travels with a woman and baby. Sacagawea proved invaluable.",
      "visuals": [
        "Chapter title: Sacagawea's Help",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "In North Dakota, we met Sacagawea, a Shoshone woman who joined us as interpreter and guide."
    },
    {
      "section": "Chapter 3: Encounters with Native Peoples",
      "duration": "1-2 minutes",
      "narration": "The expedition's success depended entirely on Native peoples. We didn't discover anything—Native nations had lived in and traveled through these lands for thousands of years. They shared knowledge that saved our lives. The Mandan people sheltered us through our first winter.",
      "visuals": [
        "Chapter title: Encounters with Native Peoples",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "The expedition's success depended entirely on Native peoples."
    },
    {
      "section": "Chapter 4: The Rocky Mountains",
      "duration": "1-2 minutes",
      "narration": "Nothing prepared us for the Rocky Mountains. Jefferson hoped we'd find an easy passage—maybe a short portage between rivers. Instead, we found a seemingly endless range of rugged peaks. The crossing nearly killed us.",
      "visuals": [
        "Chapter title: The Rocky Mountains",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "Nothing prepared us for the Rocky Mountains."
    },
    {
      "section": "Chapter 5: Reaching the Pacific",
      "duration": "1-2 minutes",
      "narration": "On November 7, 1805, we finally saw it—the Pacific Ocean. \"Ocean in view! O! the joy!\" Clark wrote in his journal.",
      "visuals": [
        "Chapter title: Reaching the Pacific",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "On November 7, 1805, we finally saw it—the Pacific Ocean."
    },
    {
      "section": "Chapter 6: What We Discovered",
      "duration": "1-2 minutes",
      "narration": "The Lewis and Clark Expedition changed America's vision of itself. Before, Americans thought of their nation as confined to lands east of the Mississippi. After, they imagined a nation spanning the continent. We brought back detailed maps, journals filled with scientific observations, specimens of unknown plants and animals.",
      "visuals": [
        "Chapter title: What We Discovered",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "The Lewis and Clark Expedition changed America's vision of itself."
    },
    {
      "section": "Conclusion",
      "duration": "30 seconds",
      "narration": "In this lesson, we explored Lewis and Clark through 6 chapters. Key concepts included: Lewis and Clark Expedition, Corps of Discovery, Sacagawea, Meriwether Lewis.",
      "visuals": [
        "Summary graphic with key points",
        "Timeline showing events covered",
        "Call to action for quiz/flashcards"
      ]
    }
  ]
}