{
  "title": "One World to the Next",
  "subtitle": "Spanish Settlement in the Americas: St. Augustine and Spain's Colonial Empire",
  "time_period": "",
  "narrator": "Mateo, a 13-year-old Spanish settler in St. Augustine, 1565",
  "sections": [
    {
      "number": 1,
      "title": "The Journey Begins",
      "summary": "My name is Mateo, and I am thirteen years old. Today marks my first full year in this strange new land called La Florida. I still remember the smell of the salt air as our ship approached the coast, the way my stomach churned—not from seasickness, but from fear and excitement twisted together like r..."
    },
    {
      "number": 2,
      "title": "Survival and Struggle",
      "summary": "The first months were the hardest. We planted crops, but the soil was different here, and many plants withered in the unforgiving sun. Fish from the nearby waters kept us alive when our Spanish provisions ran low."
    },
    {
      "number": 3,
      "title": "Building a New World",
      "summary": "As seasons passed, St. Augustine grew from a desperate outpost into something resembling a town. We built a wooden chapel where Father Alonso held mass each Sunday."
    },
    {
      "number": 4,
      "title": "Two Worlds Collide",
      "summary": "By my second year in St. Augustine, I understood that we were not just building a settlement—we were building an empire. Spain claimed this land, and settlements like ours were the foundation of that claim."
    },
    {
      "number": 5,
      "title": "Reflections on Settlement",
      "summary": "Looking back now, I see the pattern clearly. St. Augustine follows the same path as older Spanish settlements throughout the Americas."
    }
  ],
  "key_facts": [
    "Today marks my first full year in this strange new land called La Florida.",
    "We planted crops, but the soil was different here, and many plants withered in the unforgiving sun.",
    "Augustine grew from a desperate outpost into something resembling a town.",
    "Augustine, I understood that we were not just building a settlement—we were building an empire.",
    "Augustine follows the same path as older Spanish settlements throughout the Americas."
  ],
  "timeline_events": [],
  "vocabulary": [
    {
      "term": "St. Augustine",
      "definition": "The oldest continuously occupied European-established settlement in the continental United States, founded by the Spanish in 1565 in present-day Flori..."
    },
    {
      "term": "Santo Domingo",
      "definition": "Founded in 1496 on the island of Hispaniola, Santo Domingo was the first permanent European settlement in the Americas and served as the capital of Sp..."
    },
    {
      "term": "Conquistador",
      "definition": "Spanish soldiers and explorers who conquered territories in the Americas for Spain during the Age of Exploration."
    },
    {
      "term": "Havana",
      "definition": "Founded in 1519, Havana became one of the most important Spanish ports in the Caribbean. It served as a key supply hub for St. Augustine and other Spa..."
    },
    {
      "term": "Timucua",
      "definition": "Indigenous people who lived in present-day northern Florida and southeastern Georgia when the Spanish arrived."
    },
    {
      "term": "Taíno People",
      "definition": "Indigenous people who inhabited the Caribbean islands including Hispaniola, Cuba, and Puerto Rico. Their population was devastated by European disease..."
    }
  ]
}