{
  "title": "Hamilton vs. Jefferson",
  "subtitle": "Federalists vs. Democratic-Republicans (1790s)",
  "time_period": "1790s",
  "narrator": "Samuel, age 15, son of a Virginia farmer, 1796",
  "sections": [
    {
      "number": 1,
      "title": "Two Visions",
      "summary": "I'm Samuel, fifteen, and I'm learning that America has two completely different visions for its future. Alexander Hamilton and Thomas Jefferson can't agree on anything, and their disagreements are splitting the nation. Hamilton wants America to become like Britain: urban, industrial, commercial."
    },
    {
      "number": 2,
      "title": "Political Parties Form",
      "summary": "Hamilton's supporters call themselves Federalists. They're mostly merchants, bankers, manufacturers, and wealthy landowners from cities and northern states. They want a strong, active federal government."
    },
    {
      "number": 3,
      "title": "The Newspaper Wars",
      "summary": "The party battle plays out in newspapers. Hamilton secretly funds the Gazette of the United States, edited by John Fenno, which publishes Federalist views. Jefferson supports the National Gazette, edited by Philip Freneau, which attacks Federalist policies."
    },
    {
      "number": 4,
      "title": "Foreign Policy Divides Us",
      "summary": "The French Revolution makes our divisions worse. In 1789, France overthrew its monarchy, claiming to follow America's example. Jefferson and his supporters celebrate—France is becoming a republic!"
    },
    {
      "number": 5,
      "title": "The Election of 1796",
      "summary": "When Washington retires, the first true partisan presidential election happens in 1796. Federalist John Adams runs against Democratic-Republican Thomas Jefferson. There are no national campaigns—the candidates don't travel or give speeches."
    },
    {
      "number": 6,
      "title": "What Political Parties Mean",
      "summary": "The Founders hoped we wouldn't have political parties. Washington warned against them in his Farewell Address. They feared parties would put faction above country, loyalty to party above loyalty to nation."
    }
  ],
  "key_facts": [
    "I'm Samuel, fifteen, and I'm learning that America has two completely different visions for its future.",
    "They're mostly merchants, bankers, manufacturers, and wealthy landowners from cities and northern states.",
    "Hamilton secretly funds the Gazette of the United States, edited by John Fenno, which publishes Federalist views.",
    "In 1789, France overthrew its monarchy, claiming to follow America's example.",
    "When Washington retires, the first true partisan presidential election happens in 1796.",
    "The Founders hoped we wouldn't have political parties."
  ],
  "timeline_events": [],
  "vocabulary": [
    {
      "term": "Federalist Party",
      "definition": "Political party led by Hamilton favoring strong central government, national bank, and ties with Britain."
    },
    {
      "term": "Democratic-Republican Party",
      "definition": "Political party led by Jefferson favoring limited federal power, states' rights, and ties with France."
    },
    {
      "term": "Alexander Hamilton (political)",
      "definition": "Leader of Federalists who wanted strong central government, national bank, and industrial economy."
    },
    {
      "term": "Thomas Jefferson (political)",
      "definition": "Leader of Democratic-Republicans who wanted limited federal power and agricultural economy."
    },
    {
      "term": "Political Party",
      "definition": "An organized group of people with similar political views who work to elect candidates and shape policy."
    },
    {
      "term": "Tariff",
      "definition": "A tax on imported goods, supported by Federalists to protect American manufacturers."
    }
  ]
}