{
  "title": "Video Overview: Hamilton vs. Jefferson",
  "duration_estimate": "9-12 minutes",
  "sections": [
    {
      "section": "Introduction",
      "duration": "30 seconds",
      "narration": "Welcome to our lesson on Hamilton vs. Jefferson. Federalists vs. Democratic-Republicans (1790s). You'll experience this story through the eyes of Samuel, age 15, son of a Virginia farmer, 1796.",
      "visuals": [
        "Title card: Hamilton vs. Jefferson",
        "Historical map or period artwork",
        "Narrator character introduction"
      ]
    },
    {
      "section": "Chapter 1: Two Visions",
      "duration": "1-2 minutes",
      "narration": "I'm Samuel, fifteen, and I'm learning that America has two completely different visions for its future. Alexander Hamilton and Thomas Jefferson can't agree on anything, and their disagreements are splitting the nation. Hamilton wants America to become like Britain: urban, industrial, commercial. He supports a strong federal government, a national bank, tariffs to protect manufacturers, and close ties with Britain.",
      "visuals": [
        "Chapter title: Two Visions",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "I'm Samuel, fifteen, and I'm learning that America has two completely different visions for its future."
    },
    {
      "section": "Chapter 2: Political Parties Form",
      "duration": "1-2 minutes",
      "narration": "Hamilton's supporters call themselves Federalists. They're mostly merchants, bankers, manufacturers, and wealthy landowners from cities and northern states. They want a strong, active federal government. Jefferson's supporters call themselves Democratic-Republicans (or just Republicans, not related to today's Republican Party).",
      "visuals": [
        "Chapter title: Political Parties Form",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "Hamilton's supporters call themselves Federalists."
    },
    {
      "section": "Chapter 3: The Newspaper Wars",
      "duration": "1-2 minutes",
      "narration": "The party battle plays out in newspapers. Hamilton secretly funds the Gazette of the United States, edited by John Fenno, which publishes Federalist views. Jefferson supports the National Gazette, edited by Philip Freneau, which attacks Federalist policies. The papers don't just disagree—they attack viciously.",
      "visuals": [
        "Chapter title: The Newspaper Wars",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "The party battle plays out in newspapers."
    },
    {
      "section": "Chapter 4: Foreign Policy Divides Us",
      "duration": "1-2 minutes",
      "narration": "The French Revolution makes our divisions worse. In 1789, France overthrew its monarchy, claiming to follow America's example. Jefferson and his supporters celebrate—France is becoming a republic! But when the revolution turns violent with mass executions and radical policies, Federalists are horrified.",
      "visuals": [
        "Chapter title: Foreign Policy Divides Us",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "The French Revolution makes our divisions worse."
    },
    {
      "section": "Chapter 5: The Election of 1796",
      "duration": "1-2 minutes",
      "narration": "When Washington retires, the first true partisan presidential election happens in 1796. Federalist John Adams runs against Democratic-Republican Thomas Jefferson. There are no national campaigns—the candidates don't travel or give speeches. But their supporters wage vicious newspaper wars.",
      "visuals": [
        "Chapter title: The Election of 1796",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "When Washington retires, the first true partisan presidential election happens in 1796."
    },
    {
      "section": "Chapter 6: What Political Parties Mean",
      "duration": "1-2 minutes",
      "narration": "The Founders hoped we wouldn't have political parties. Washington warned against them in his Farewell Address. They feared parties would put faction above country, loyalty to party above loyalty to nation. But parties emerged anyway because Americans genuinely disagree about fundamental questions: Should the federal government be strong or limited?",
      "visuals": [
        "Chapter title: What Political Parties Mean",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "The Founders hoped we wouldn't have political parties."
    },
    {
      "section": "Conclusion",
      "duration": "30 seconds",
      "narration": "In this lesson, we explored Hamilton vs. Jefferson through 6 chapters. Key concepts included: Federalist Party, Democratic-Republican Party, Alexander Hamilton (political), Thomas Jefferson (political).",
      "visuals": [
        "Summary graphic with key points",
        "Timeline showing events covered",
        "Call to action for quiz/flashcards"
      ]
    }
  ]
}