{
  "title": "The End of Reconstruction",
  "subtitle": "Compromise of 1877",
  "time_period": "",
  "narrator": "Samuel, age 17, Black voter in Mississippi, 1877",
  "sections": [
    {
      "number": 1,
      "title": "The North Grows Weary",
      "summary": "I'm Samuel, seventeen years old, and I live in Mississippi. I was born free in 1860, just before the Civil War. My early childhood was during slavery, though my family was free."
    },
    {
      "number": 2,
      "title": "Redemption Through Violence",
      "summary": "White Southern Democrats launch campaigns to \"redeem\" the South—their term for restoring white supremacy and Democratic control. They use legal and illegal methods, but mostly violence and intimidation. In Mississippi, the 1875 election campaign is called the \"Mississippi Plan\"—a blueprint for viole..."
    },
    {
      "number": 3,
      "title": "The Disputed Election of 1876",
      "summary": "November 1876. The presidential election pits Republican Rutherford B. Hayes against Democrat Samuel Tilden."
    },
    {
      "number": 4,
      "title": "The Last Troops Leave",
      "summary": "April 1877. President Hayes orders the last federal troops withdrawn from Louisiana and South Carolina. Reconstruction is over."
    },
    {
      "number": 5,
      "title": "Reconstruction's Legacy",
      "summary": "By 1880, Reconstruction is dead. White supremacists control the South. Black people are segregated, disenfranchised, and terrorized."
    }
  ],
  "key_facts": [
    "I'm Samuel, seventeen years old, and I live in Mississippi.",
    "White Southern Democrats launch campaigns to \"redeem\" the South—their term for restoring white supremacy and Democratic control.",
    "The presidential election pits Republican Rutherford B.",
    "President Hayes orders the last federal troops withdrawn from Louisiana and South Carolina.",
    "Black people are segregated, disenfranchised, and terrorized."
  ],
  "timeline_events": [],
  "vocabulary": [
    {
      "term": "Compromise of 1877",
      "definition": "Agreement ending Reconstruction by withdrawing federal troops from South."
    },
    {
      "term": "End of Reconstruction",
      "definition": "1877 withdrawal of federal troops, ending protections for Southern Blacks."
    },
    {
      "term": "Redemption",
      "definition": "White Southerners' term for restoring Democratic control and white supremacy."
    },
    {
      "term": "Jim Crow",
      "definition": "System of racial segregation and discrimination in the South (1877-1960s)."
    },
    {
      "term": "Disenfranchisement",
      "definition": "Systematic denial of voting rights through violence, intimidation, and legal restrictions."
    },
    {
      "term": "Poll Tax",
      "definition": "Fee required to vote, used to prevent poor Blacks from voting."
    }
  ]
}