{
  "title": "The Nullification Crisis",
  "subtitle": "States' Rights vs Federal Power (1832)",
  "time_period": "1832",
  "narrator": "James, age 16, from South Carolina, 1832",
  "sections": [
    {
      "number": 1,
      "title": "The Tariff Crisis",
      "summary": "I'm James, sixteen, from South Carolina. Our state is in uproar over what we call the \"Tariff of Abominations.\" This high protective tariff helps Northern manufacturers by making imported goods expensive, forcing Americans to buy Northern-made products. But we don't manufacture—we grow cotton."
    },
    {
      "number": 2,
      "title": "Calhoun's Theory",
      "summary": "Father explains Calhoun's logic: the Constitution is a compact among sovereign states. The states created the federal government and delegated it certain limited powers. When the federal government exceeds those powers, states have the right to judge and resist."
    },
    {
      "number": 3,
      "title": "Jackson's Response",
      "summary": "President Jackson's reaction shocked us. Jackson is a Southerner, a states' rights advocate, a slave owner. We expected sympathy."
    },
    {
      "number": 4,
      "title": "Clay's Compromise",
      "summary": "Henry Clay, the \"Great Compromiser,\" found a way out. He proposed gradually reducing the tariff over ten years while simultaneously passing Jackson's Force Bill. South Carolina could claim victory—the tariff would be lowered."
    },
    {
      "number": 5,
      "title": "The Crisis's Meaning",
      "summary": "The Nullification Crisis revealed deep fractures in American unity. It showed that sectional loyalty can rival national loyalty, that states might choose disunion over submission to national majority rule. It foreshadowed the Civil War."
    }
  ],
  "key_facts": [
    "We sell cotton on the world market at world prices, but we must buy manufactured goods at inflated prices because of the tariff.",
    "Father explains Calhoun's logic: the Constitution is a compact among sovereign states.",
    "Jackson is a Southerner, a states' rights advocate, a slave owner.",
    "Henry Clay, the \"Great Compromiser,\" found a way out.",
    "The Nullification Crisis revealed deep fractures in American unity."
  ],
  "timeline_events": [],
  "vocabulary": [
    {
      "term": "Nullification",
      "definition": "Theory that states can refuse to enforce federal laws they consider unconstitutional."
    },
    {
      "term": "Tariff of Abominations",
      "definition": "High protective tariff favored by North, opposed by South, triggering crisis."
    },
    {
      "term": "John C. Calhoun",
      "definition": "SC politician who developed nullification theory."
    },
    {
      "term": "States' Rights",
      "definition": "Idea that states retain significant sovereignty and can resist federal overreach."
    },
    {
      "term": "Force Bill",
      "definition": "Law authorizing President to use military force to enforce federal law."
    },
    {
      "term": "Protective Tariff",
      "definition": "Tax on imports to protect domestic industries from foreign competition."
    }
  ]
}