{
  "title": "Seneca Falls Convention",
  "subtitle": "Birth of Women's Rights Movement (1848)",
  "time_period": "1848",
  "narrator": "Charlotte, age 17, at the convention, 1848",
  "sections": [
    {
      "number": 1,
      "title": "Declaration of Sentiments",
      "summary": "I'm Charlotte, seventeen, attending the first women's rights convention in Seneca Falls, New York. Elizabeth Cady Stanton and Lucretia Mott organized this gathering—about 300 people, including 40 men. Frederick Douglass, the great abolitionist, came to support us."
    },
    {
      "number": 2,
      "title": "The Case for Women's Rights",
      "summary": "The convention challenges the doctrine of \"separate spheres\"—the idea that men naturally belong in public life (politics, business, the professions) while women naturally belong in domestic life (home, children, moral influence). This ideology claims women are too delicate, too emotional, too pure f..."
    },
    {
      "number": 3,
      "title": "Immediate Backlash",
      "summary": "The convention concluded with 68 women and 32 men signing the Declaration of Sentiments. We left energized, hopeful, ready to change the world. Then the newspapers arrived."
    },
    {
      "number": 4,
      "title": "The Long Road Ahead",
      "summary": "Despite the backlash, I'm not discouraged. Stanton predicted opposition. \"We expect opposition,\" she said."
    },
    {
      "number": 5,
      "title": "Planting Seeds",
      "summary": "Standing in Seneca Falls at the close of the convention, I understand we've started something that will outlive us all. We're not demanding immediate change—we know that's impossible. We're planting seeds that future generations will harvest."
    }
  ],
  "key_facts": [
    "I'm Charlotte, seventeen, attending the first women's rights convention in Seneca Falls, New York.",
    "This ideology claims women are too delicate, too emotional, too pure for the rough world of politics and commerce.",
    "The convention concluded with 68 women and 32 men signing the Declaration of Sentiments.",
    "But truth eventually prevails.\" She's right—every reform movement faces mockery before acceptance.",
    "Standing in Seneca Falls at the close of the convention, I understand we've started something that will outlive us all."
  ],
  "timeline_events": [],
  "vocabulary": [
    {
      "term": "Seneca Falls Convention",
      "definition": "1848 meeting launching organized women's rights movement."
    },
    {
      "term": "Declaration of Sentiments",
      "definition": "Document declaring men and women created equal, modeled on Declaration of Independence."
    },
    {
      "term": "Elizabeth Cady Stanton",
      "definition": "Key organizer of Seneca Falls and lifelong women's rights advocate."
    },
    {
      "term": "Lucretia Mott",
      "definition": "Quaker abolitionist who helped organize Seneca Falls."
    },
    {
      "term": "Women's Suffrage",
      "definition": "Right of women to vote—most controversial Seneca Falls demand."
    },
    {
      "term": "Separate Spheres",
      "definition": "Ideology that men belong in public life, women in domestic life."
    }
  ]
}