{
  "title": "Video Overview: Seneca Falls Convention",
  "duration_estimate": "8-10 minutes",
  "sections": [
    {
      "section": "Introduction",
      "duration": "30 seconds",
      "narration": "Welcome to our lesson on Seneca Falls Convention. Birth of Women's Rights Movement (1848). You'll experience this story through the eyes of Charlotte, age 17, at the convention, 1848.",
      "visuals": [
        "Title card: Seneca Falls Convention",
        "Historical map or period artwork",
        "Narrator character introduction"
      ]
    },
    {
      "section": "Chapter 1: Declaration of Sentiments",
      "duration": "1-2 minutes",
      "narration": "I'm Charlotte, seventeen, attending the first women's rights convention in Seneca Falls, New York. Elizabeth Cady Stanton and Lucretia Mott organized this gathering—about 300 people, including 40 men. Frederick Douglass, the great abolitionist, came to support us. Stanton drafted a \"Declaration of Sentiments\" that mirrors the Declaration of Independence.",
      "visuals": [
        "Chapter title: Declaration of Sentiments",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "I'm Charlotte, seventeen, attending the first women's rights convention in Seneca Falls, New York."
    },
    {
      "section": "Chapter 2: The Case for Women's Rights",
      "duration": "1-2 minutes",
      "narration": "The convention challenges the doctrine of \"separate spheres\"—the idea that men naturally belong in public life (politics, business, the professions) while women naturally belong in domestic life (home, children, moral influence). This ideology claims women are too delicate, too emotional, too pure for the rough world of politics and commerce. Stanton argues these aren't natural differences but social constructions. Women seem unsuited for public life because they're denied education, experience, and opportunity—not because they lack capability.",
      "visuals": [
        "Chapter title: The Case for Women's Rights",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "The convention challenges the doctrine of \"separate spheres\"—the idea that men naturally belong in public life (politics, business, the professions) while women naturally belong in domestic life (home, children, moral influence)."
    },
    {
      "section": "Chapter 3: Immediate Backlash",
      "duration": "1-2 minutes",
      "narration": "The convention concluded with 68 women and 32 men signing the Declaration of Sentiments. We left energized, hopeful, ready to change the world. Then the newspapers arrived. The mockery is brutal.",
      "visuals": [
        "Chapter title: Immediate Backlash",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "The convention concluded with 68 women and 32 men signing the Declaration of Sentiments."
    },
    {
      "section": "Chapter 4: The Long Road Ahead",
      "duration": "1-2 minutes",
      "narration": "Despite the backlash, I'm not discouraged. Stanton predicted opposition. \"We expect opposition,\" she said. \"All great truths face resistance.",
      "visuals": [
        "Chapter title: The Long Road Ahead",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "Despite the backlash, I'm not discouraged."
    },
    {
      "section": "Chapter 5: Planting Seeds",
      "duration": "1-2 minutes",
      "narration": "Standing in Seneca Falls at the close of the convention, I understand we've started something that will outlive us all. We're not demanding immediate change—we know that's impossible. We're planting seeds that future generations will harvest. The Declaration of Sentiments gives the women's rights movement its founding document, its statement of principles, its catalogue of grievances.",
      "visuals": [
        "Chapter title: Planting Seeds",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "Standing in Seneca Falls at the close of the convention, I understand we've started something that will outlive us all."
    },
    {
      "section": "Conclusion",
      "duration": "30 seconds",
      "narration": "In this lesson, we explored Seneca Falls Convention through 5 chapters. Key concepts included: Seneca Falls Convention, Declaration of Sentiments, Elizabeth Cady Stanton, Lucretia Mott.",
      "visuals": [
        "Summary graphic with key points",
        "Timeline showing events covered",
        "Call to action for quiz/flashcards"
      ]
    }
  ]
}