{
  "title": "Uncle Tom's Cabin",
  "subtitle": "The Power of Literature (1852)",
  "time_period": "1852",
  "narrator": "Rebecca, age 14, Northern girl, 1852",
  "sections": [
    {
      "number": 1,
      "title": "A Book That Changed America",
      "summary": "I'm Rebecca, fourteen years old, living in Boston. Everyone in my family is reading Uncle Tom's Cabin by Harriet Beecher Stowe. The novel was published this year, 1852, and it's become the most talked-about book in America."
    },
    {
      "number": 2,
      "title": "The Characters Come Alive",
      "summary": "The characters in Uncle Tom's Cabin feel real to me. Uncle Tom isn't just a name in a newspaper story about slavery—he's a person I know through Mrs. Stowe's words."
    },
    {
      "number": 3,
      "title": "Reaction in the North",
      "summary": "Uncle Tom's Cabin is everywhere in the North. It's selling faster than any book in American history—300,000 copies in the first year. Only the Bible sells more copies."
    },
    {
      "number": 4,
      "title": "Southern Outrage",
      "summary": "The South is furious about Uncle Tom's Cabin. Southern newspapers call it lies, propaganda, and slander. They say Mrs."
    },
    {
      "number": 5,
      "title": "The Power of Words",
      "summary": "It's extraordinary that a novel—a work of fiction—could have such political impact. But Uncle Tom's Cabin proves that stories can change the world. Mrs."
    }
  ],
  "key_facts": [
    "Everyone in my family is reading Uncle Tom's Cabin by Harriet Beecher Stowe.",
    "The characters in Uncle Tom's Cabin feel real to me.",
    "It's selling faster than any book in American history—300,000 copies in the first year.",
    "Southern newspapers call it lies, propaganda, and slander.",
    "It's extraordinary that a novel—a work of fiction—could have such political impact."
  ],
  "timeline_events": [],
  "vocabulary": [
    {
      "term": "Uncle Tom's Cabin",
      "definition": "1852 anti-slavery novel by Harriet Beecher Stowe that influenced Northern opinion."
    },
    {
      "term": "Harriet Beecher Stowe",
      "definition": "Author whose novel Uncle Tom's Cabin galvanized Northern opposition to slavery."
    },
    {
      "term": "Uncle Tom",
      "definition": "Main character in Stowe's novel—faithful slave sold away from family."
    },
    {
      "term": "Simon Legree",
      "definition": "Cruel slave owner in novel who became symbol of slavery's brutality."
    },
    {
      "term": "Eliza",
      "definition": "Character who fled slavery by crossing icy Ohio River with her baby."
    },
    {
      "term": "Abolitionist Literature",
      "definition": "Books and publications advocating end of slavery."
    }
  ]
}