{
  "title": "Common Sense & Independence",
  "subtitle": "The Declaration of Independence (1776)",
  "time_period": "1776",
  "narrator": "Hannah, age 16, daughter of a Philadelphia delegate, 1776",
  "sections": [
    {
      "number": 1,
      "title": "Common Sense",
      "summary": "My name is Hannah, and I am sixteen years old. My father is a delegate to the Continental Congress meeting here in Philadelphia. In January, a pamphlet called \"Common Sense\" by Thomas Paine swept through the colonies like wildfire."
    },
    {
      "number": 2,
      "title": "Writing the Declaration",
      "summary": "On June 7, Richard Henry Lee proposed that \"these United Colonies are, and of right ought to be, free and independent States.\" The Congress appointed a committee to draft a declaration: Thomas Jefferson, John Adams, Benjamin Franklin, and two others. Jefferson did most of the writing. I saw him arou..."
    },
    {
      "number": 3,
      "title": "The Vote for Independence",
      "summary": "On July 2, 1776, the Continental Congress voted for independence. Twelve colonies voted yes; New York abstained but later agreed. July 2 is actually Independence Day, though we'll celebrate July 4, when the Declaration was formally adopted."
    },
    {
      "number": 4,
      "title": "Revolutionary Ideas",
      "summary": "The Declaration is more than a list of complaints against King George. It's a statement of revolutionary political philosophy drawn from Enlightenment thinkers like John Locke. The ideas it expresses will echo through history."
    },
    {
      "number": 5,
      "title": "The Price of Freedom",
      "summary": "After the signing, Benjamin Franklin reportedly said, \"We must all hang together, or most assuredly we shall all hang separately.\" He meant it literally. By signing the Declaration, fifty-six men committed treason against Britain. If we lose this war, they'll be executed."
    }
  ],
  "key_facts": [
    "My father is a delegate to the Continental Congress meeting here in Philadelphia.",
    "I saw him around Philadelphia, looking tired and worried.",
    "On July 2, 1776, the Continental Congress voted for independence.",
    "The Declaration is more than a list of complaints against King George.",
    "After the signing, Benjamin Franklin reportedly said, \"We must all hang together, or most assuredly we shall all hang separately.\" He meant it literally."
  ],
  "timeline_events": [],
  "vocabulary": [
    {
      "term": "Common Sense",
      "definition": "A 1776 pamphlet by Thomas Paine arguing for American independence in plain language that influenced public opinion."
    },
    {
      "term": "Declaration of Independence",
      "definition": "The 1776 document declaring American independence and explaining the philosophical basis for revolution."
    },
    {
      "term": "Thomas Jefferson",
      "definition": "Primary author of the Declaration of Independence, expressing Enlightenment ideals about rights and government."
    },
    {
      "term": "Unalienable Rights",
      "definition": "Rights that cannot be taken away, including life, liberty, and the pursuit of happiness according to the Declaration."
    },
    {
      "term": "All Men Are Created Equal",
      "definition": "A principle from the Declaration stating that all people have equal value and rights, though not practiced in reality."
    },
    {
      "term": "Thomas Paine",
      "definition": "Author of Common Sense, which persuaded many colonists to support independence from Britain."
    }
  ]
}