{
  "title": "Diversity in the Colonies",
  "subtitle": "The Middle Colonies: New York, Pennsylvania, New Jersey, Delaware (1664-1700)",
  "time_period": "1664-1700",
  "narrator": "Maria, age 14, daughter of a Dutch merchant in New York, 1680",
  "sections": [
    {
      "number": 1,
      "title": "From New Netherland to New York",
      "summary": "My name is Maria, and I am fourteen years old. I live in New York, though my family still calls it by its old name: New Amsterdam. My parents are Dutch, and they remember when this colony belonged to the Netherlands, not England."
    },
    {
      "number": 2,
      "title": "Penn's Holy Experiment",
      "summary": "My uncle moved to Pennsylvania, the new colony founded by William Penn, a Quaker. The Quakers are strange to us—they believe everyone is equal before God, they refuse to take oaths or fight in wars, and they let women preach in their meetings. In England, they're persecuted for these beliefs."
    },
    {
      "number": 3,
      "title": "Market Day",
      "summary": "Tuesday is market day at the dock, and I help Father sell goods from his warehouse. The waterfront buzzes with activity—ships arriving from London, Amsterdam, the Caribbean. Sailors speak in tongues I don't recognize, their skin bearing the sun of distant seas."
    },
    {
      "number": 4,
      "title": "A Different Kind of Colony",
      "summary": "The Middle Colonies are different from New England and the South. In New England, the Puritans control everything—religion, government, daily life. They don't tolerate other beliefs."
    },
    {
      "number": 5,
      "title": "The Price of Tolerance",
      "summary": "Not everyone celebrates our diversity. Some ministers warn that tolerating false religions invites God's wrath. When a Catholic family moved onto our street, neighbors muttered about popish plots and foreign loyalties."
    }
  ],
  "key_facts": [
    "I live in New York, though my family still calls it by its old name: New Amsterdam.",
    "My uncle moved to Pennsylvania, the new colony founded by William Penn, a Quaker.",
    "Tuesday is market day at the dock, and I help Father sell goods from his warehouse.",
    "The Middle Colonies are different from New England and the South.",
    "Some ministers warn that tolerating false religions invites God's wrath."
  ],
  "timeline_events": [],
  "vocabulary": [
    {
      "term": "Middle Colonies",
      "definition": "New York, Pennsylvania, New Jersey, and Delaware. Known for religious tolerance, diverse populations, and fertile farmland."
    },
    {
      "term": "New Amsterdam",
      "definition": "Dutch settlement that became New York City when the English took control in 1664. It was a diverse trading port."
    },
    {
      "term": "William Penn",
      "definition": "Quaker leader who founded Pennsylvania as a 'holy experiment' in religious tolerance and peaceful relations with Native Americans."
    },
    {
      "term": "Quakers",
      "definition": "Religious group that believed in equality of all people, refused to fight in wars, and allowed women to preach. They were persecuted in England."
    },
    {
      "term": "Philadelphia",
      "definition": "Capital of Pennsylvania, founded by William Penn. The name means 'city of brotherly love' in Greek."
    },
    {
      "term": "Bread Basket Colonies",
      "definition": "Nickname for the Middle Colonies because they grew large amounts of wheat and grain for export."
    }
  ]
}