{
  "title": "Colonial Life on the Eve of Revolution",
  "subtitle": "Society and Culture in 1763",
  "time_period": "",
  "narrator": "Rachel, age 15, daughter of a Philadelphia printer, 1763",
  "sections": [
    {
      "number": 1,
      "title": "Life in the City",
      "summary": "My name is Rachel, and I am fifteen years old. I live in Philadelphia, the largest city in the colonies with over 20,000 people. Our city has paved streets, brick buildings, street lamps, and a bustling port."
    },
    {
      "number": 2,
      "title": "Education and Ideas",
      "summary": "Education matters greatly to colonists, though it varies by region and class. In New England, towns fund public schools because Puritans believe everyone should read the Bible. The Middle Colonies have private schools and academies."
    },
    {
      "number": 3,
      "title": "Different Regions, Shared Identity",
      "summary": "Despite our differences, a shared colonial identity is emerging. We're beginning to see ourselves not just as Virginians or New Yorkers, but as Americans—distinct from the British. Trade connects us."
    },
    {
      "number": 4,
      "title": "The Coming Storm",
      "summary": "Last week, news arrived that makes Father worried. Britain has huge debts from the French and Indian War—over £140 million. Parliament plans to raise taxes on the colonies to help pay for it."
    },
    {
      "number": 5,
      "title": "Contradictions and Possibilities",
      "summary": "Today, I helped Father set type for a pamphlet about natural rights. The author argues that all men are created equal, that they possess inalienable rights to life, liberty, and property. As I arranged the metal letters, I wondered: does \"all men\" include women like me?"
    }
  ],
  "key_facts": [
    "I live in Philadelphia, the largest city in the colonies with over 20,000 people.",
    "Education matters greatly to colonists, though it varies by region and class.",
    "Despite our differences, a shared colonial identity is emerging.",
    "Britain has huge debts from the French and Indian War—over £140 million.",
    "Today, I helped Father set type for a pamphlet about natural rights."
  ],
  "timeline_events": [],
  "vocabulary": [
    {
      "term": "Enlightenment",
      "definition": "An intellectual movement emphasizing reason, science, individual rights, and questioning traditional authority. Influenced colonial thinking about gov..."
    },
    {
      "term": "John Locke",
      "definition": "Enlightenment philosopher who wrote about natural rights (life, liberty, property) and government by consent of the governed. Heavily influenced Ameri..."
    },
    {
      "term": "Natural Rights",
      "definition": "Rights that all people are born with, including life, liberty, and property. Cannot be taken away by government according to Enlightenment philosophy."
    },
    {
      "term": "Apprenticeship",
      "definition": "A system where young people learned trades by working for a master craftsman for several years in exchange for training, room, and board."
    },
    {
      "term": "Colonial Identity",
      "definition": "The emerging sense that colonists were becoming a distinct people—Americans—with their own interests separate from Britain."
    },
    {
      "term": "Urban vs. Rural",
      "definition": "The divide between city dwellers (urban) and countryside farmers (rural), who often had different economic interests and lifestyles."
    }
  ]
}