{
  "title": "French and Indian War",
  "subtitle": "The Seven Years' War in America (1754-1763)",
  "time_period": "1754-1763",
  "narrator": "Benjamin, age 16, a colonial militiaman from Virginia, 1755",
  "sections": [
    {
      "number": 1,
      "title": "Clash of Empires",
      "summary": "My name is Benjamin, and I am sixteen years old. I joined the Virginia militia last spring, following a young officer named George Washington into the wilderness beyond the Allegheny Mountains. We were sent to protect Virginia's claim to the Ohio River Valley—land that both England and France claim ..."
    },
    {
      "number": 2,
      "title": "Braddock's Defeat",
      "summary": "The next year, the British sent General Edward Braddock with two regiments of professional soldiers. They were going to capture Fort Duquesne, the French stronghold where Pittsburgh stands today. I marched with them, part of the colonial militia supporting the British regulars."
    },
    {
      "number": 3,
      "title": "The Tide Turns",
      "summary": "For several years, the war went badly for Britain. The French won victory after victory. Their Native allies raided frontier settlements, and colonists fled east for safety."
    },
    {
      "number": 4,
      "title": "Seeds of Revolution",
      "summary": "The war changed everything, though we didn't see it at first. Britain had huge war debts and thought the colonies should help pay them—after all, the war had been fought partly for our benefit. They planned to station 10,000 troops in America and expected us to help pay for them through new taxes."
    },
    {
      "number": 5,
      "title": "The Other Side",
      "summary": "I'm older now, twenty-five, with scars from battles and memories that haunt me. Time has given me perspective I lacked as a young militiaman. We celebrated Britain's victory, but I've come to understand what we rarely acknowledged: this was someone else's loss, someone else's catastrophe."
    }
  ],
  "key_facts": [
    "I joined the Virginia militia last spring, following a young officer named George Washington into the wilderness beyond the Allegheny Mountains.",
    "The next year, the British sent General Edward Braddock with two regiments of professional soldiers.",
    "Their Native allies raided frontier settlements, and colonists fled east for safety.",
    "The war changed everything, though we didn't see it at first.",
    "I'm older now, twenty-five, with scars from battles and memories that haunt me."
  ],
  "timeline_events": [],
  "vocabulary": [
    {
      "term": "French and Indian War",
      "definition": "The North American theater of the Seven Years' War (1754-1763), fought between British colonists and French colonists, each with Native American allie..."
    },
    {
      "term": "Ohio River Valley",
      "definition": "The disputed territory between the Appalachian Mountains and Mississippi River that both France and Britain claimed, sparking the war."
    },
    {
      "term": "George Washington",
      "definition": "Young Virginia officer who fought in early battles of the French and Indian War, gaining military experience that would later prove crucial."
    },
    {
      "term": "Fort Duquesne",
      "definition": "French fort at the site of present-day Pittsburgh, a key strategic point fought over during the war."
    },
    {
      "term": "Battle of Quebec",
      "definition": "The decisive 1759 battle where British forces under General Wolfe defeated the French, leading to British control of Canada."
    },
    {
      "term": "Treaty of Paris (1763)",
      "definition": "The treaty ending the French and Indian War, giving Britain control of Canada and all land east of the Mississippi River."
    }
  ]
}