{
  "title": "Video Overview: Women's Suffrage",
  "duration_estimate": "8-10 minutes",
  "sections": [
    {
      "section": "Introduction",
      "duration": "30 seconds",
      "narration": "Welcome to our lesson on Women's Suffrage. Winning the Vote (1848-1920). You'll experience this story through the eyes of Alice, age 16, suffragist, 1920.",
      "visuals": [
        "Title card: Women's Suffrage",
        "Historical map or period artwork",
        "Narrator character introduction"
      ]
    },
    {
      "section": "Chapter 1: Seneca Falls to Susan B. Anthony",
      "duration": "1-2 minutes",
      "narration": "I'm Alice, sixteen years old, and today—August 26, 1920—I watched my mother vote for the first time in her life. The Nineteenth Amendment has been ratified. Women have won the right to vote after 72 years of struggle. The fight began at Seneca Falls, New York in 1848.",
      "visuals": [
        "Chapter title: Seneca Falls to Susan B. Anthony",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "I'm Alice, sixteen years old, and today—August 26, 1920—I watched my mother vote for the first time in her life."
    },
    {
      "section": "Chapter 2: Two Strategies—NAWSA and the NWP",
      "duration": "1-2 minutes",
      "narration": "By the early 1900s, the suffrage movement split into two organizations with different strategies. The National American Woman Suffrage Association (NAWSA), led by Carrie Chapman Catt, pursued a state-by-state strategy. They lobbied state legislatures to grant women voting rights, believing success at the state level would build momentum for a federal amendment. Wyoming granted women's suffrage in 1869, followed by Colorado, Utah, Idaho, and eventually fifteen states by 1914.",
      "visuals": [
        "Chapter title: Two Strategies—NAWSA and the NWP",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "By the early 1900s, the suffrage movement split into two organizations with different strategies."
    },
    {
      "section": "Chapter 3: The Final Push—Wilson Changes His Mind",
      "duration": "1-2 minutes",
      "narration": "President Woodrow Wilson initially opposed women's suffrage, saying it was a state issue, not a federal one. But the combination of NAWSA's lobbying, the NWP's protests, and women's contributions to the war effort changed his mind. During World War I, women took jobs in factories, served as nurses, sold war bonds, and managed farms while men fought overseas. They proved they could handle responsibilities traditionally reserved for men.",
      "visuals": [
        "Chapter title: The Final Push—Wilson Changes His Mind",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "President Woodrow Wilson initially opposed women's suffrage, saying it was a state issue, not a federal one."
    },
    {
      "section": "Chapter 4: The First Vote",
      "duration": "1-2 minutes",
      "narration": "November 2, 1920. The first presidential election where women can vote nationwide. Mother and I go to the polling place together. She's forty-five years old and voting for the first time.",
      "visuals": [
        "Chapter title: The First Vote",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "November 2, 1920."
    },
    {
      "section": "Chapter 5: Victory Incomplete",
      "duration": "1-2 minutes",
      "narration": "The celebration is joyful but also bittersweet. We've won a crucial victory, but equality is far from achieved. First, many Black women still can't vote. The Nineteenth Amendment prohibits discrimination \"on account of sex,\" but Southern states use the same Jim Crow tactics against Black women that they use against Black men: poll taxes, literacy tests, grandfather clauses, violence, and intimidation.",
      "visuals": [
        "Chapter title: Victory Incomplete",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "The celebration is joyful but also bittersweet."
    },
    {
      "section": "Conclusion",
      "duration": "30 seconds",
      "narration": "In this lesson, we explored Women's Suffrage through 5 chapters. Key concepts included: Women's Suffrage, Nineteenth Amendment, Susan B. Anthony, Elizabeth Cady Stanton.",
      "visuals": [
        "Summary graphic with key points",
        "Timeline showing events covered",
        "Call to action for quiz/flashcards"
      ]
    }
  ]
}