{
  "title": "Radical Reconstruction",
  "subtitle": "Congressional Control (1867-1870)",
  "time_period": "1867-1870",
  "narrator": "Eliza, age 16, freed slave in South Carolina, 1868",
  "sections": [
    {
      "number": 1,
      "title": "Congress Takes Control",
      "summary": "I'm Eliza, sixteen years old, and I live in South Carolina. I was born enslaved but freed when I was thirteen, after the Civil War ended. The past three years have been chaotic—freedom without resources, Black Codes restricting our rights, President Johnson allowing former Confederates back into pow..."
    },
    {
      "number": 2,
      "title": "Constitutional Conventions",
      "summary": "Early 1868. South Carolina holds a constitutional convention to write a new state constitution. For the first time, Black men participate in government."
    },
    {
      "number": 3,
      "title": "The Fourteenth and Fifteenth Amendments",
      "summary": "The constitutional changes aren't just at the state level. Congress is rewriting the U.S. Constitution to protect Black rights."
    },
    {
      "number": 4,
      "title": "Progress and Achievement",
      "summary": "The years 1868-1870 are a time of remarkable progress in South Carolina. Black men serve in the legislature, as sheriffs and judges, as members of Congress. Hiram Revels of Mississippi becomes the first Black U.S."
    },
    {
      "number": 5,
      "title": "The Reign of Terror",
      "summary": "But white conservatives won't accept this new order. They use violence to restore white supremacy and undo Reconstruction. The Ku Klux Klan—a terrorist organization of former Confederates—spreads across the South."
    }
  ],
  "key_facts": [
    "I'm Eliza, sixteen years old, and I live in South Carolina.",
    "South Carolina holds a constitutional convention to write a new state constitution.",
    "The constitutional changes aren't just at the state level.",
    "The years 1868-1870 are a time of remarkable progress in South Carolina.",
    "But white conservatives won't accept this new order."
  ],
  "timeline_events": [],
  "vocabulary": [
    {
      "term": "Radical Reconstruction",
      "definition": "Congressional plan (1867-1877) imposing harsh terms on South and protecting Black rights."
    },
    {
      "term": "Fourteenth Amendment",
      "definition": "1868 amendment granting citizenship and equal protection to freed slaves."
    },
    {
      "term": "Fifteenth Amendment",
      "definition": "1870 amendment protecting voting rights regardless of race."
    },
    {
      "term": "Reconstruction Acts",
      "definition": "Laws placing South under military control until new constitutions guaranteeing Black voting rights."
    },
    {
      "term": "Ku Klux Klan",
      "definition": "Terrorist organization using violence to restore white supremacy and intimidate Black voters."
    },
    {
      "term": "Hiram Revels",
      "definition": "First Black U.S. Senator, representing Mississippi during Reconstruction."
    }
  ]
}