{
  "title": "The Progressive Era",
  "subtitle": "Reform Movements (1900-1920)",
  "time_period": "1900-1920",
  "narrator": "Catherine, age 15, settlement house worker, 1910",
  "sections": [
    {
      "number": 1,
      "title": "Hull House and the Settlement Movement",
      "summary": "I'm Catherine, fifteen years old, and I volunteer at Hull House in Chicago. Hull House is a settlement house founded by Jane Addams in 1889. It's located in a poor immigrant neighborhood where Italian, Polish, Greek, and Russian immigrants live crowded in tenements."
    },
    {
      "number": 2,
      "title": "The Muckrakers Expose Corruption",
      "summary": "Progressive reform is powered by investigative journalists called \"muckrakers\"—President Theodore Roosevelt's term for journalists who \"rake the muck\" of society's problems. Ida Tarbell writes \"The History of the Standard Oil Company\" (1904), exposing how John D. Rockefeller built his monopoly throu..."
    },
    {
      "number": 3,
      "title": "Theodore Roosevelt and the Square Deal",
      "summary": "Theodore Roosevelt becomes president in 1901 when McKinley is assassinated. At 42, he's the youngest president in history. He's energetic, charismatic, and committed to Progressive reform."
    },
    {
      "number": 4,
      "title": "Woodrow Wilson and the New Freedom",
      "summary": "Woodrow Wilson wins the presidency in 1912, running as a Progressive Democrat against Theodore Roosevelt (running as a Progressive/Bull Moose candidate) and conservative Republican William Howard Taft. Wilson's \"New Freedom\" program aims to restore competition by breaking up monopolies rather than j..."
    },
    {
      "number": 5,
      "title": "The Progressive Legacy—Promise and Limits",
      "summary": "By 1920, I'm 25 years old and still involved in reform work. The Progressive Era has transformed America in remarkable ways. We've achieved major reforms:\n• Pure Food and Drug Act protects consumers\n• Antitrust laws limit monopoly power\n• Conservation preserves natural resources\n• Income tax and dir..."
    }
  ],
  "key_facts": [
    "I'm Catherine, fifteen years old, and I volunteer at Hull House in Chicago.",
    "Progressive reform is powered by investigative journalists called \"muckrakers\"—President Theodore Roosevelt's term for journalists who \"rake the muck\" of society's problems.",
    "Theodore Roosevelt becomes president in 1901 when McKinley is assassinated.",
    "Wilson's \"New Freedom\" program aims to restore competition by breaking up monopolies rather than just regulating them.",
    "By 1920, I'm 25 years old and still involved in reform work."
  ],
  "timeline_events": [],
  "vocabulary": [
    {
      "term": "Progressive Era",
      "definition": "Period (1900-1920) of political and social reform movements."
    },
    {
      "term": "Muckrakers",
      "definition": "Journalists exposing corruption and social problems."
    },
    {
      "term": "Upton Sinclair",
      "definition": "Author of 'The Jungle' exposing meatpacking industry horrors."
    },
    {
      "term": "Theodore Roosevelt",
      "definition": "Progressive president who 'trust-busted' monopolies and conserved nature."
    },
    {
      "term": "Hull House",
      "definition": "Settlement house founded by Jane Addams to help immigrants and poor."
    },
    {
      "term": "Seventeenth Amendment",
      "definition": "1913 amendment providing direct election of senators."
    }
  ]
}