{
  "title": "Video Overview: The Progressive Era",
  "duration_estimate": "8-10 minutes",
  "sections": [
    {
      "section": "Introduction",
      "duration": "30 seconds",
      "narration": "Welcome to our lesson on The Progressive Era. Reform Movements (1900-1920). You'll experience this story through the eyes of Catherine, age 15, settlement house worker, 1910.",
      "visuals": [
        "Title card: The Progressive Era",
        "Historical map or period artwork",
        "Narrator character introduction"
      ]
    },
    {
      "section": "Chapter 1: Hull House and the Settlement Movement",
      "duration": "1-2 minutes",
      "narration": "I'm Catherine, fifteen years old, and I volunteer at Hull House in Chicago. Hull House is a settlement house founded by Jane Addams in 1889. It's located in a poor immigrant neighborhood where Italian, Polish, Greek, and Russian immigrants live crowded in tenements. Settlement houses are community centers where reformers live among the poor, offering education, social services, and advocacy.",
      "visuals": [
        "Chapter title: Hull House and the Settlement Movement",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "I'm Catherine, fifteen years old, and I volunteer at Hull House in Chicago."
    },
    {
      "section": "Chapter 2: The Muckrakers Expose Corruption",
      "duration": "1-2 minutes",
      "narration": "Progressive reform is powered by investigative journalists called \"muckrakers\"—President Theodore Roosevelt's term for journalists who \"rake the muck\" of society's problems. Ida Tarbell writes \"The History of the Standard Oil Company\" (1904), exposing how John D. Rockefeller built his monopoly through ruthless, often illegal tactics. Her detailed reporting turns public opinion against corporate monopolies.",
      "visuals": [
        "Chapter title: The Muckrakers Expose Corruption",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "Progressive reform is powered by investigative journalists called \"muckrakers\"—President Theodore Roosevelt's term for journalists who \"rake the muck\" of society's problems."
    },
    {
      "section": "Chapter 3: Theodore Roosevelt and the Square Deal",
      "duration": "1-2 minutes",
      "narration": "Theodore Roosevelt becomes president in 1901 when McKinley is assassinated. At 42, he's the youngest president in history. He's energetic, charismatic, and committed to Progressive reform. Roosevelt's \"Square Deal\" promises fairness for workers, consumers, and businesses.",
      "visuals": [
        "Chapter title: Theodore Roosevelt and the Square Deal",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "Theodore Roosevelt becomes president in 1901 when McKinley is assassinated."
    },
    {
      "section": "Chapter 4: Woodrow Wilson and the New Freedom",
      "duration": "1-2 minutes",
      "narration": "Woodrow Wilson wins the presidency in 1912, running as a Progressive Democrat against Theodore Roosevelt (running as a Progressive/Bull Moose candidate) and conservative Republican William Howard Taft. Wilson's \"New Freedom\" program aims to restore competition by breaking up monopolies rather than just regulating them. He achieves major reforms:\n\nThe Underwood Tariff (1913) reduces import taxes, lowering consumer prices and reducing corporate protection from foreign competition. To replace lost revenue, it establishes the first permanent federal income tax under the new Sixteenth Amendment.",
      "visuals": [
        "Chapter title: Woodrow Wilson and the New Freedom",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "Woodrow Wilson wins the presidency in 1912, running as a Progressive Democrat against Theodore Roosevelt (running as a Progressive/Bull Moose candidate) and conservative Republican William Howard Taft."
    },
    {
      "section": "Chapter 5: The Progressive Legacy—Promise and Limits",
      "duration": "1-2 minutes",
      "narration": "By 1920, I'm 25 years old and still involved in reform work. The Progressive Era has transformed America in remarkable ways. We've achieved major reforms:\n• Pure Food and Drug Act protects consumers\n• Antitrust laws limit monopoly power\n• Conservation preserves natural resources\n• Income tax and direct election of senators make government more democratic\n• Labor laws improve working conditions (though child labor and long hours persist)\n• Women won the vote with the Nineteenth Amendment (1920)\n\nBut the Progressive Era has serious limitations and contradictions. Racial injustice: Most Progressives ignore or actively support segregation.",
      "visuals": [
        "Chapter title: The Progressive Legacy—Promise and Limits",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "By 1920, I'm 25 years old and still involved in reform work."
    },
    {
      "section": "Conclusion",
      "duration": "30 seconds",
      "narration": "In this lesson, we explored The Progressive Era through 5 chapters. Key concepts included: Progressive Era, Muckrakers, Upton Sinclair, Theodore Roosevelt.",
      "visuals": [
        "Summary graphic with key points",
        "Timeline showing events covered",
        "Call to action for quiz/flashcards"
      ]
    }
  ]
}