{
  "title": "Victory at Yorktown",
  "subtitle": "Winning Independence (1781)",
  "time_period": "1781",
  "narrator": "Marcus, age 16, son of a freed Black soldier, 1781",
  "sections": [
    {
      "number": 1,
      "title": "A Long War",
      "summary": "I'm Marcus, sixteen years old. My father is a freed Black man fighting for American independence in exchange for his freedom. For six years, this war has dragged on."
    },
    {
      "number": 2,
      "title": "The Trap Closes",
      "summary": "Washington marches his army south, coordinating with French General Rochambeau. The French fleet under Admiral de Grasse sails into Chesapeake Bay, defeating the British navy and blocking Cornwallis's escape by sea. American and French forces surround Yorktown by land."
    },
    {
      "number": 3,
      "title": "The Siege",
      "summary": "The siege of Yorktown lasts three weeks, and every day brings us closer to victory. Our artillery—American and French cannons positioned in carefully dug trenches—pounds the British positions day and night. The sound is constant, thunderous."
    },
    {
      "number": 4,
      "title": "Surrender",
      "summary": "On October 19, 1781, Cornwallis surrenders. Over 7,000 British soldiers lay down their weapons. As they march out, their band plays \"The World Turned Upside Down\"—an appropriate song."
    },
    {
      "number": 5,
      "title": "What Victory Means",
      "summary": "As I watch the British surrender, I think about what this victory means for different people. For General Washington and the Continental Army, it's vindication of over six years of sacrifice. For the French, it's revenge against their British rivals."
    }
  ],
  "key_facts": [
    "My father is a freed Black man fighting for American independence in exchange for his freedom.",
    "Washington marches his army south, coordinating with French General Rochambeau.",
    "The siege of Yorktown lasts three weeks, and every day brings us closer to victory.",
    "Over 7,000 British soldiers lay down their weapons.",
    "As I watch the British surrender, I think about what this victory means for different people."
  ],
  "timeline_events": [],
  "vocabulary": [
    {
      "term": "Battle of Yorktown",
      "definition": "The decisive 1781 battle where Washington and French forces trapped and defeated British General Cornwallis, ending major fighting in the Revolutionar..."
    },
    {
      "term": "General Cornwallis",
      "definition": "British general who surrendered at Yorktown, ending major combat in the Revolutionary War."
    },
    {
      "term": "Admiral de Grasse",
      "definition": "French admiral whose fleet blocked Chesapeake Bay, preventing British escape by sea and enabling the Yorktown victory."
    },
    {
      "term": "Rochambeau",
      "definition": "French general who commanded French forces fighting alongside Washington at Yorktown."
    },
    {
      "term": "Siege",
      "definition": "A military tactic of surrounding and bombarding an enemy position to force surrender, used at Yorktown."
    },
    {
      "term": "Black Patriots",
      "definition": "African Americans who fought for American independence, often in exchange for freedom from slavery."
    }
  ]
}