{
  "title": "Video Overview: Victory at Yorktown",
  "duration_estimate": "8-10 minutes",
  "sections": [
    {
      "section": "Introduction",
      "duration": "30 seconds",
      "narration": "Welcome to our lesson on Victory at Yorktown. Winning Independence (1781). You'll experience this story through the eyes of Marcus, age 16, son of a freed Black soldier, 1781.",
      "visuals": [
        "Title card: Victory at Yorktown",
        "Historical map or period artwork",
        "Narrator character introduction"
      ]
    },
    {
      "section": "Chapter 1: A Long War",
      "duration": "1-2 minutes",
      "narration": "I'm Marcus, sixteen years old. My father is a freed Black man fighting for American independence in exchange for his freedom. For six years, this war has dragged on. We've won some battles, lost others.",
      "visuals": [
        "Chapter title: A Long War",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "I'm Marcus, sixteen years old."
    },
    {
      "section": "Chapter 2: The Trap Closes",
      "duration": "1-2 minutes",
      "narration": "Washington marches his army south, coordinating with French General Rochambeau. The French fleet under Admiral de Grasse sails into Chesapeake Bay, defeating the British navy and blocking Cornwallis's escape by sea. American and French forces surround Yorktown by land. Cornwallis is trapped.",
      "visuals": [
        "Chapter title: The Trap Closes",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "Washington marches his army south, coordinating with French General Rochambeau."
    },
    {
      "section": "Chapter 3: The Siege",
      "duration": "1-2 minutes",
      "narration": "The siege of Yorktown lasts three weeks, and every day brings us closer to victory. Our artillery—American and French cannons positioned in carefully dug trenches—pounds the British positions day and night. The sound is constant, thunderous. I help carry ammunition, my ears ringing from the noise.",
      "visuals": [
        "Chapter title: The Siege",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "The siege of Yorktown lasts three weeks, and every day brings us closer to victory."
    },
    {
      "section": "Chapter 4: Surrender",
      "duration": "1-2 minutes",
      "narration": "On October 19, 1781, Cornwallis surrenders. Over 7,000 British soldiers lay down their weapons. As they march out, their band plays \"The World Turned Upside Down\"—an appropriate song. We colonists have defeated the mighty British Empire.",
      "visuals": [
        "Chapter title: Surrender",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "On October 19, 1781, Cornwallis surrenders."
    },
    {
      "section": "Chapter 5: What Victory Means",
      "duration": "1-2 minutes",
      "narration": "As I watch the British surrender, I think about what this victory means for different people. For General Washington and the Continental Army, it's vindication of over six years of sacrifice. For the French, it's revenge against their British rivals. For most Americans, it's the chance to govern themselves without kings or lords.",
      "visuals": [
        "Chapter title: What Victory Means",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "As I watch the British surrender, I think about what this victory means for different people."
    },
    {
      "section": "Conclusion",
      "duration": "30 seconds",
      "narration": "In this lesson, we explored Victory at Yorktown through 5 chapters. Key concepts included: Battle of Yorktown, General Cornwallis, Admiral de Grasse, Rochambeau.",
      "visuals": [
        "Summary graphic with key points",
        "Timeline showing events covered",
        "Call to action for quiz/flashcards"
      ]
    }
  ]
}