{
  "title": "Video Overview: The Gilded Age",
  "duration_estimate": "8-10 minutes",
  "sections": [
    {
      "section": "Introduction",
      "duration": "30 seconds",
      "narration": "Welcome to our lesson on The Gilded Age. Industry and Inequality (1870-1900). You'll experience this story through the eyes of Anna, age 15, factory worker in New York, 1890.",
      "visuals": [
        "Title card: The Gilded Age",
        "Historical map or period artwork",
        "Narrator character introduction"
      ]
    },
    {
      "section": "Chapter 1: The Golden Surface",
      "duration": "1-2 minutes",
      "narration": "I'm Anna, fifteen years old, and I work in a garment factory in New York City. My family immigrated from Italy two years ago seeking opportunity in America. What we found was hard work, poverty, and inequality—but also a nation transforming before our eyes. This era is called the Gilded Age—a name from Mark Twain's novel.",
      "visuals": [
        "Chapter title: The Golden Surface",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "I'm Anna, fifteen years old, and I work in a garment factory in New York City."
    },
    {
      "section": "Chapter 2: Life in the Factory",
      "duration": "1-2 minutes",
      "narration": "I work twelve hours a day, six days a week in a garment factory making shirtwaists (women's blouses). The factory is on the eighth floor of a building with no fire escapes. Three hundred women and girls work here, crowded together at sewing machines. We arrive at 7 a.m.",
      "visuals": [
        "Chapter title: Life in the Factory",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "I work twelve hours a day, six days a week in a garment factory making shirtwaists (women's blouses)."
    },
    {
      "section": "Chapter 3: The Titans of Industry",
      "duration": "1-2 minutes",
      "narration": "The men who control American industry are sometimes called \"Robber Barons\"—a term suggesting they stole their fortunes. Others call them \"Captains of Industry\"—leaders who built America's economy. The truth is complicated. Andrew Carnegie is a good example.",
      "visuals": [
        "Chapter title: The Titans of Industry",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "The men who control American industry are sometimes called \"Robber Barons\"—a term suggesting they stole their fortunes."
    },
    {
      "section": "Chapter 4: Child Labor and Exploitation",
      "duration": "1-2 minutes",
      "narration": "The worst aspect of the Gilded Age is child labor. Children as young as six work in mines, factories, and fields instead of attending school. I see it daily in the garment factory where ten-year-old girls work alongside me. In coal mines, young boys work as \"breakers\"—sitting for twelve hours sorting coal, breathing dust that ruins their lungs.",
      "visuals": [
        "Chapter title: Child Labor and Exploitation",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "The worst aspect of the Gilded Age is child labor."
    },
    {
      "section": "Chapter 5: The Meaning of Progress",
      "duration": "1-2 minutes",
      "narration": "The Gilded Age forces us to ask: What is progress? By some measures, America is progressing rapidly. Steel production increases more than one hundred fold between 1870 and 1900. Railroad mileage quadruples.",
      "visuals": [
        "Chapter title: The Meaning of Progress",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "The Gilded Age forces us to ask: What is progress?"
    },
    {
      "section": "Conclusion",
      "duration": "30 seconds",
      "narration": "In this lesson, we explored The Gilded Age through 5 chapters. Key concepts included: Gilded Age, Robber Barons, Andrew Carnegie, John D. Rockefeller.",
      "visuals": [
        "Summary graphic with key points",
        "Timeline showing events covered",
        "Call to action for quiz/flashcards"
      ]
    }
  ]
}