{
  "title": "Indian Removal",
  "subtitle": "The Trail of Tears (1830-1838)",
  "time_period": "1830-1838",
  "narrator": "Sarah, age 14, Cherokee girl, 1838",
  "sections": [
    {
      "number": 1,
      "title": "Our Cherokee Life",
      "summary": "I'm Sarah, fourteen years old, Cherokee. My people have lived in these Georgia mountains for generations—longer than anyone can remember. We're not the \"savages\" white people imagine."
    },
    {
      "number": 2,
      "title": "The Indian Removal Act",
      "summary": "In 1830, Congress passed the Indian Removal Act. President Jackson claims it's voluntary—tribes can choose to move west of the Mississippi to \"Indian Territory\" in exchange for their eastern lands. But everyone knows the truth: refuse, and you'll be forced out anyway."
    },
    {
      "number": 3,
      "title": "Soldiers Come",
      "summary": "Spring 1838. Soldiers arrive with guns and bayonets. General Winfield Scott commands 7,000 troops to round up Cherokee and force us west."
    },
    {
      "number": 4,
      "title": "The Trail Where We Cried",
      "summary": "October 1838. We begin the thousand-mile march to Oklahoma. Over 16,000 Cherokee forced west in groups."
    },
    {
      "number": 5,
      "title": "Oklahoma and After",
      "summary": "We reached Indian Territory in March 1839. Of 16,000 who started, only about 12,000 arrived. Over 4,000 dead—a quarter of our people."
    }
  ],
  "key_facts": [
    "My people have lived in these Georgia mountains for generations—longer than anyone can remember.",
    "President Jackson claims it's voluntary—tribes can choose to move west of the Mississippi to \"Indian Territory\" in exchange for their eastern lands.",
    "General Winfield Scott commands 7,000 troops to round up Cherokee and force us west.",
    "Dysentery, measles, whooping cough spread through our column.",
    "And we're not the only ones—Creek, Seminole, Chickasaw, Choctaw all suffered similar removals."
  ],
  "timeline_events": [],
  "vocabulary": [
    {
      "term": "Indian Removal Act",
      "definition": "1830 law authorizing removal of Native tribes from eastern lands to territory west of Mississippi."
    },
    {
      "term": "Trail of Tears",
      "definition": "Forced 1,000-mile march of Cherokee to Oklahoma, killing over 4,000."
    },
    {
      "term": "Cherokee Nation",
      "definition": "Native tribe that had adopted European customs but was still forcibly removed."
    },
    {
      "term": "Sequoyah",
      "definition": "Cherokee scholar who created written Cherokee language."
    },
    {
      "term": "Worcester v. Georgia",
      "definition": "Supreme Court case ruling for Cherokee—ignored by Jackson."
    },
    {
      "term": "Indian Territory",
      "definition": "Land in present Oklahoma where tribes were forced to relocate."
    }
  ]
}