{
  "title": "The Second Great Awakening",
  "subtitle": "Religious Revival and Reform (1800-1840)",
  "time_period": "1800-1840",
  "narrator": "Emily, age 15, from New York, 1831",
  "sections": [
    {
      "number": 1,
      "title": "Religious Revival",
      "summary": "I'm Emily, fifteen, from Rochester, New York—part of what they call the \"Burned-Over District\" because religious revivals sweep through so often it's like the land has been burned over by spiritual fire. This year, 1831, Charles Finney held a six-month revival here that transformed our town. Thousan..."
    },
    {
      "number": 2,
      "title": "Perfectionism and Reform",
      "summary": "The Second Great Awakening teaches that people can be perfected through faith. This idea has explosive implications: if individuals can be perfected, why not perfect society? Religious enthusiasm spills into social activism."
    },
    {
      "number": 3,
      "title": "The Abolition Movement",
      "summary": "The most radical reform inspired by the Awakening is abolition—the immediate end to slavery. William Lloyd Garrison publishes The Liberator, demanding emancipation now, without compensation to slaveholders, without colonization to Africa. His motto: \"I will be heard!\"\n\nThis position is far more extr..."
    },
    {
      "number": 4,
      "title": "Women's Growing Role",
      "summary": "The Second Great Awakening empowers women in unexpected ways. Revivals welcome women's participation—they can testify, lead prayer groups, even sometimes preach. This challenges the traditional view that women should be silent in church and submissive at home."
    },
    {
      "number": 5,
      "title": "The Reform Legacy",
      "summary": "The Second Great Awakening transforms American society. It makes religion emotional and personal rather than formal and institutional. It empowers individuals to choose their salvation."
    }
  ],
  "key_facts": [
    "This year, 1831, Charles Finney held a six-month revival here that transformed our town.",
    "The Second Great Awakening teaches that people can be perfected through faith.",
    "The most radical reform inspired by the Awakening is abolition—the immediate end to slavery.",
    "The Second Great Awakening empowers women in unexpected ways.",
    "The Second Great Awakening transforms American society."
  ],
  "timeline_events": [],
  "vocabulary": [
    {
      "term": "Second Great Awakening",
      "definition": "Religious revival (1800-1840) emphasizing personal conversion and moral reform."
    },
    {
      "term": "Charles Finney",
      "definition": "Leading revivalist preacher emphasizing free will."
    },
    {
      "term": "Burned-Over District",
      "definition": "Western New York where intense revivals repeatedly occurred."
    },
    {
      "term": "Temperance Movement",
      "definition": "Reform movement advocating limiting/banning alcohol."
    },
    {
      "term": "Abolition",
      "definition": "Movement to end slavery immediately."
    },
    {
      "term": "Moral Reform",
      "definition": "Belief society could be perfected through religious-inspired improvements."
    }
  ]
}