{
  "title": "The Southern Way",
  "subtitle": "Southern Colonies and the Growth of Slavery (1660-1700)",
  "time_period": "1660-1700",
  "narrator": "Thomas, age 14, son of a small tobacco farmer in Virginia, 1690",
  "sections": [
    {
      "number": 1,
      "title": "Life on a Small Farm",
      "summary": "My name is Thomas, and I am fourteen years old. My family owns a small tobacco farm in Virginia. We're not wealthy planters with hundreds of acres—we have just fifty acres and grow enough tobacco to make a modest living."
    },
    {
      "number": 2,
      "title": "The Growth of Slavery",
      "summary": "Our neighbor, Mr. Randolph, is a wealthy planter. He owns a plantation with two hundred acres and twenty enslaved workers."
    },
    {
      "number": 3,
      "title": "Different Souths",
      "summary": "The Southern colonies are different from each other. Virginia and Maryland grow tobacco. South Carolina grows rice in coastal swamps where the work is brutal and deadly."
    },
    {
      "number": 4,
      "title": "Understanding the System",
      "summary": "I've been thinking a lot about what Father said. How did we get here? How did English colonists who came seeking freedom create a system that denies freedom to others?"
    },
    {
      "number": 5,
      "title": "Resistance and Humanity",
      "summary": "Last week, three enslaved people escaped from Randolph's plantation. They disappeared into the forest, heading north. Randolph hired slave catchers with dogs to track them."
    }
  ],
  "key_facts": [
    "We're not wealthy planters with hundreds of acres—we have just fifty acres and grow enough tobacco to make a modest living.",
    "He owns a plantation with two hundred acres and twenty enslaved workers.",
    "The Southern colonies are different from each other.",
    "How did English colonists who came seeking freedom create a system that denies freedom to others?",
    "Last week, three enslaved people escaped from Randolph's plantation."
  ],
  "timeline_events": [],
  "vocabulary": [
    {
      "term": "Plantation",
      "definition": "A large farm that grew cash crops like tobacco, rice, or indigo using enslaved labor. Plantations dominated the Southern economy."
    },
    {
      "term": "Cash Crop",
      "definition": "A crop grown primarily for sale and profit rather than for the farmer's own use. Examples include tobacco, rice, and indigo."
    },
    {
      "term": "Slavery",
      "definition": "A system in which people are treated as property, forced to work without pay, and denied freedom. In the American colonies, slavery was based on race."
    },
    {
      "term": "Middle Passage",
      "definition": "The horrific voyage that brought enslaved Africans across the Atlantic Ocean to the Americas. Millions died during this journey."
    },
    {
      "term": "Rice Cultivation",
      "definition": "Rice became South Carolina's main cash crop in the 1690s. Rice fields in coastal swamps required flooding and draining, making the work brutal and dea..."
    },
    {
      "term": "Overseer",
      "definition": "A person hired by plantation owners to supervise enslaved workers and ensure productivity, often through harsh punishment."
    }
  ]
}