{
  "title": "Lincoln's Election & Secession",
  "subtitle": "The Union Breaks (1860-1861)",
  "time_period": "1860-1861",
  "narrator": "William, age 15, from South Carolina, 1860",
  "sections": [
    {
      "number": 1,
      "title": "The Election of 1860",
      "summary": "I'm William, fifteen years old, from Charleston, South Carolina. The presidential election of 1860 has our city in turmoil. Father says this election will determine whether we remain in the Union or leave it."
    },
    {
      "number": 2,
      "title": "Lincoln Wins—The South Reacts",
      "summary": "November 6, 1860. Election results arrive by telegraph. Abraham Lincoln has won the presidency."
    },
    {
      "number": 3,
      "title": "The Confederacy Forms",
      "summary": "South Carolina's secession triggers a chain reaction. Within weeks, six more states of the Deep South follow: Mississippi, Florida, Alabama, Georgia, Louisiana, and Texas. All cite Lincoln's election and Northern hostility to slavery as reasons for leaving."
    },
    {
      "number": 4,
      "title": "The Fort Sumter Crisis",
      "summary": "Charleston Harbor, March 1861. Fort Sumter, a federal fort on an island in our harbor, remains under Union control. Major Robert Anderson commands about 80 U.S."
    },
    {
      "number": 5,
      "title": "The Nation Chooses Sides",
      "summary": "April 15, 1861. President Lincoln responds to Fort Sumter's fall by calling for 75,000 volunteers to suppress the rebellion. He's calling us rebels."
    }
  ],
  "key_facts": [
    "I'm William, fifteen years old, from Charleston, South Carolina.",
    "He carried every Northern state except New Jersey (which he split with Douglas).",
    "South Carolina's secession triggers a chain reaction.",
    "Fort Sumter, a federal fort on an island in our harbor, remains under Union control.",
    "President Lincoln responds to Fort Sumter's fall by calling for 75,000 volunteers to suppress the rebellion."
  ],
  "timeline_events": [],
  "vocabulary": [
    {
      "term": "Abraham Lincoln",
      "definition": "First Republican president whose election triggered Southern secession."
    },
    {
      "term": "Secession",
      "definition": "Southern states leaving the Union to form the Confederacy."
    },
    {
      "term": "Confederate States of America",
      "definition": "Nation formed by eleven seceding Southern states."
    },
    {
      "term": "Jefferson Davis",
      "definition": "President of the Confederate States of America."
    },
    {
      "term": "Fort Sumter",
      "definition": "Federal fort in Charleston where Civil War began with Confederate attack."
    },
    {
      "term": "Border States",
      "definition": "Slave states (Delaware, Maryland, Kentucky, Missouri) that stayed in Union."
    }
  ]
}