{
  "title": "Video Overview: The Shot Heard Round the World",
  "duration_estimate": "8-10 minutes",
  "sections": [
    {
      "section": "Introduction",
      "duration": "30 seconds",
      "narration": "Welcome to our lesson on The Shot Heard Round the World. Lexington and Concord (1775). You'll experience this story through the eyes of Nathan, age 17, a Minuteman from Concord, Massachusetts, 1775.",
      "visuals": [
        "Title card: The Shot Heard Round the World",
        "Historical map or period artwork",
        "Narrator character introduction"
      ]
    },
    {
      "section": "Chapter 1: The Midnight Ride",
      "duration": "1-2 minutes",
      "narration": "My name is Nathan, and I am seventeen years old. I'm a Minuteman—part of our militia trained to be ready at a minute's notice. Tonight, April 18, 1775, that training will be tested. Word has reached us that British troops are marching from Boston to seize our weapons and gunpowder stored in Concord, and possibly to arrest Samuel Adams and John Hancock who are hiding in Lexington.",
      "visuals": [
        "Chapter title: The Midnight Ride",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "My name is Nathan, and I am seventeen years old."
    },
    {
      "section": "Chapter 2: Lexington Green",
      "duration": "1-2 minutes",
      "narration": "At dawn in Lexington, Captain John Parker lined up about 70 militiamen on the town green. They could hear the British approaching—marching feet, rattling equipment, officers shouting commands. The British force was ten times their size. Parker told his men: \"Stand your ground.",
      "visuals": [
        "Chapter title: Lexington Green",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "At dawn in Lexington, Captain John Parker lined up about 70 militiamen on the town green."
    },
    {
      "section": "Chapter 3: The Battle of Concord",
      "duration": "1-2 minutes",
      "narration": "By the time the British reached Concord, we'd assembled hundreds of militiamen. We watched from a ridge as British soldiers searched the town for weapons and supplies. We'd hidden most of it, but they found some and started burning it. Smoke rose from the town center.",
      "visuals": [
        "Chapter title: The Battle of Concord",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "By the time the British reached Concord, we'd assembled hundreds of militiamen."
    },
    {
      "section": "Chapter 4: No Turning Back",
      "duration": "1-2 minutes",
      "narration": "Tonight, I'm home, exhausted and shaken. I fired my musket at British soldiers today. British soldiers fired at me. Some of my neighbors are dead.",
      "visuals": [
        "Chapter title: No Turning Back",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "Tonight, I'm home, exhausted and shaken."
    },
    {
      "section": "Chapter 5: The Weight of Choice",
      "duration": "1-2 minutes",
      "narration": "Three days have passed. The reality of what we've done settles over me like a heavy cloak. I attended the funeral of Isaac Davis, our militia captain, killed at North Bridge. His widow wept.",
      "visuals": [
        "Chapter title: The Weight of Choice",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "Three days have passed."
    },
    {
      "section": "Conclusion",
      "duration": "30 seconds",
      "narration": "In this lesson, we explored The Shot Heard Round the World through 5 chapters. Key concepts included: Lexington and Concord, Minutemen, Paul Revere, Shot Heard Round the World.",
      "visuals": [
        "Summary graphic with key points",
        "Timeline showing events covered",
        "Call to action for quiz/flashcards"
      ]
    }
  ]
}