{
  "title": "Video Overview: The Boston Tea Party",
  "duration_estimate": "8-10 minutes",
  "sections": [
    {
      "section": "Introduction",
      "duration": "30 seconds",
      "narration": "Welcome to our lesson on The Boston Tea Party. Colonial Resistance Escalates (1773). You'll experience this story through the eyes of Thomas, age 15, apprentice to a Boston carpenter, 1773.",
      "visuals": [
        "Title card: The Boston Tea Party",
        "Historical map or period artwork",
        "Narrator character introduction"
      ]
    },
    {
      "section": "Chapter 1: The Tea Act",
      "duration": "1-2 minutes",
      "narration": "My name is Thomas, and I am fifteen years old. I work as an apprentice carpenter in Boston, but tonight I'm about to become part of history. Parliament has passed the Tea Act, giving the British East India Company a monopoly on tea sales in the colonies. This will drive colonial tea merchants out of business and force us to buy British tea—with a tax attached.",
      "visuals": [
        "Chapter title: The Tea Act",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "My name is Thomas, and I am fifteen years old."
    },
    {
      "section": "Chapter 2: The Destruction of the Tea",
      "duration": "1-2 minutes",
      "narration": "Outside the meeting house, I see men disguising themselves as Mohawk Indians—a thin disguise of blankets, face paint, and feathers. It's meant to hide our identities and perhaps to symbolize that we're Americans, not British. I join them. My heart races with excitement and fear.",
      "visuals": [
        "Chapter title: The Destruction of the Tea",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "Outside the meeting house, I see men disguising themselves as Mohawk Indians—a thin disguise of blankets, face paint, and feathers."
    },
    {
      "section": "Chapter 3: The Intolerable Acts",
      "duration": "1-2 minutes",
      "narration": "Britain's response is swift and harsh. Parliament passes laws we call the Intolerable Acts. The Boston Port Act closes Boston Harbor until we pay for the tea—shutting down our economy. The Massachusetts Government Act strips away our charter and self-government.",
      "visuals": [
        "Chapter title: The Intolerable Acts",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "Britain's response is swift and harsh."
    },
    {
      "section": "Chapter 4: Colonial Unity Emerges",
      "duration": "1-2 minutes",
      "narration": "In September 1774, representatives from twelve colonies (all except Georgia) met in Philadelphia for the First Continental Congress. This was extraordinary—never before had the colonies united like this. Each colony had always looked after its own interests. But now we realized that an attack on one colony was an attack on all.",
      "visuals": [
        "Chapter title: Colonial Unity Emerges",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "In September 1774, representatives from twelve colonies (all except Georgia) met in Philadelphia for the First Continental Congress."
    },
    {
      "section": "Chapter 5: The Point of No Return",
      "duration": "1-2 minutes",
      "narration": "Looking back now, I see that December night in 1773 as the point of no return. We'd protested before—boycotts, petitions, demonstrations. But dumping the tea was different. We'd destroyed British property worth a fortune.",
      "visuals": [
        "Chapter title: The Point of No Return",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "Looking back now, I see that December night in 1773 as the point of no return."
    },
    {
      "section": "Conclusion",
      "duration": "30 seconds",
      "narration": "In this lesson, we explored The Boston Tea Party through 5 chapters. Key concepts included: Boston Tea Party, Tea Act, Intolerable Acts, Boston Port Act.",
      "visuals": [
        "Summary graphic with key points",
        "Timeline showing events covered",
        "Call to action for quiz/flashcards"
      ]
    }
  ]
}