{
  "title": "Triangular Trade",
  "subtitle": "Colonial Economy and Atlantic Trade (1650-1750)",
  "time_period": "1650-1750",
  "narrator": "James, age 15, son of a merchant ship captain in Boston, 1720",
  "sections": [
    {
      "number": 1,
      "title": "A Merchant's Life",
      "summary": "My name is James, and I am fifteen years old. My father is a captain of a merchant ship that sails the Atlantic trade routes. I've been on three voyages with him, learning the merchant's trade and keeping the ship's ledgers."
    },
    {
      "number": 2,
      "title": "The Colonial Economy",
      "summary": "The thirteen colonies produce different goods based on their climate and resources. New England, where we live, has rocky soil but excellent harbors. We build ships, catch fish, and produce rum from West Indian molasses."
    },
    {
      "number": 3,
      "title": "Navigation Acts and Mercantilism",
      "summary": "England controls colonial trade through the Navigation Acts. These laws say we can only trade certain goods with England or other English colonies. We must use English ships with English crews."
    },
    {
      "number": 4,
      "title": "The Human Cost",
      "summary": "Last year, we were in port in Charleston when a slave ship arrived from Africa. I watched from the dock as the enslaved people were brought up from the hold—thin, sick, traumatized. The smell was unbearable."
    },
    {
      "number": 5,
      "title": "Breaking the Chain",
      "summary": "I've made a decision that Father doesn't fully understand. When I inherit the business, I will not trade in goods produced by enslaved labor. No sugar, no tobacco, no rice, no indigo."
    }
  ],
  "key_facts": [
    "My father is a captain of a merchant ship that sails the Atlantic trade routes.",
    "The thirteen colonies produce different goods based on their climate and resources.",
    "England controls colonial trade through the Navigation Acts.",
    "Last year, we were in port in Charleston when a slave ship arrived from Africa.",
    "I've made a decision that Father doesn't fully understand."
  ],
  "timeline_events": [],
  "vocabulary": [
    {
      "term": "Triangular Trade",
      "definition": "The Atlantic trade system connecting Europe, Africa, and the Americas, involving the exchange of manufactured goods, enslaved people, and raw material..."
    },
    {
      "term": "Mercantilism",
      "definition": "An economic system where colonies exist to enrich the mother country by providing raw materials and buying manufactured goods."
    },
    {
      "term": "Navigation Acts",
      "definition": "English laws controlling colonial trade, requiring colonists to trade certain goods only with England and use English ships."
    },
    {
      "term": "Cash Crop",
      "definition": "Crops grown primarily for sale and profit rather than personal use, such as tobacco, rice, and sugar. Indigo would later become another important cash..."
    },
    {
      "term": "Middle Passage",
      "definition": "The brutal ocean voyage that forcibly transported enslaved Africans to the Americas, part of the triangular trade system."
    },
    {
      "term": "Smuggling",
      "definition": "Illegal trade that violated the Navigation Acts, often conducted with French or Spanish colonies to avoid English restrictions."
    }
  ]
}