{
  "title": "Video Overview: Triangular Trade",
  "duration_estimate": "8-10 minutes",
  "sections": [
    {
      "section": "Introduction",
      "duration": "30 seconds",
      "narration": "Welcome to our lesson on Triangular Trade. Colonial Economy and Atlantic Trade (1650-1750). You'll experience this story through the eyes of James, age 15, son of a merchant ship captain in Boston, 1720.",
      "visuals": [
        "Title card: Triangular Trade",
        "Historical map or period artwork",
        "Narrator character introduction"
      ]
    },
    {
      "section": "Chapter 1: A Merchant's Life",
      "duration": "1-2 minutes",
      "narration": "My name is James, and I am fifteen years old. My father is a captain of a merchant ship that sails the Atlantic trade routes. I've been on three voyages with him, learning the merchant's trade and keeping the ship's ledgers. Our ship is part of what people call the \"triangular trade\"—though it's not always a perfect triangle.",
      "visuals": [
        "Chapter title: A Merchant's Life",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "My name is James, and I am fifteen years old."
    },
    {
      "section": "Chapter 2: The Colonial Economy",
      "duration": "1-2 minutes",
      "narration": "The thirteen colonies produce different goods based on their climate and resources. New England, where we live, has rocky soil but excellent harbors. We build ships, catch fish, and produce rum from West Indian molasses. We're merchants and craftsmen more than farmers.",
      "visuals": [
        "Chapter title: The Colonial Economy",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "The thirteen colonies produce different goods based on their climate and resources."
    },
    {
      "section": "Chapter 3: Navigation Acts and Mercantilism",
      "duration": "1-2 minutes",
      "narration": "England controls colonial trade through the Navigation Acts. These laws say we can only trade certain goods with England or other English colonies. We must use English ships with English crews. Valuable goods like tobacco and sugar must go to England first, even if they're destined for other countries.",
      "visuals": [
        "Chapter title: Navigation Acts and Mercantilism",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "England controls colonial trade through the Navigation Acts."
    },
    {
      "section": "Chapter 4: The Human Cost",
      "duration": "1-2 minutes",
      "narration": "Last year, we were in port in Charleston when a slave ship arrived from Africa. I watched from the dock as the enslaved people were brought up from the hold—thin, sick, traumatized. The smell was unbearable. Many had died during the Middle Passage, their bodies thrown overboard like cargo.",
      "visuals": [
        "Chapter title: The Human Cost",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "Last year, we were in port in Charleston when a slave ship arrived from Africa."
    },
    {
      "section": "Chapter 5: Breaking the Chain",
      "duration": "1-2 minutes",
      "narration": "I've made a decision that Father doesn't fully understand. When I inherit the business, I will not trade in goods produced by enslaved labor. No sugar, no tobacco, no rice, no indigo. I know this will cost us profit—these are the most valuable commodities in Atlantic trade.",
      "visuals": [
        "Chapter title: Breaking the Chain",
        "Period-appropriate imagery",
        "Key concept highlights",
        "Animated map or diagram (if applicable)"
      ],
      "key_takeaway": "I've made a decision that Father doesn't fully understand."
    },
    {
      "section": "Conclusion",
      "duration": "30 seconds",
      "narration": "In this lesson, we explored Triangular Trade through 5 chapters. Key concepts included: Triangular Trade, Mercantilism, Navigation Acts, Cash Crop.",
      "visuals": [
        "Summary graphic with key points",
        "Timeline showing events covered",
        "Call to action for quiz/flashcards"
      ]
    }
  ]
}